/* automatically generated by rust-bindgen */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub unsafe fn as_ptr(&self) -> *const T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut_ptr(&mut self) -> *mut T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
impl<T> ::std::clone::Clone for __IncompleteArrayField<T> {
    #[inline]
    fn clone(&self) -> Self {
        Self::new()
    }
}
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;

pub const XCB_CREATE_GLYPH_CURSOR: u32 = 94;
pub const XCB_FREE_CURSOR: u32 = 95;
pub const XCB_RECOLOR_CURSOR: u32 = 96;
pub const XCB_QUERY_BEST_SIZE: u32 = 97;
pub const XCB_QUERY_EXTENSION: u32 = 98;
pub const XCB_LIST_EXTENSIONS: u32 = 99;
pub const XCB_CHANGE_KEYBOARD_MAPPING: u32 = 100;
pub const XCB_GET_KEYBOARD_MAPPING: u32 = 101;
pub const XCB_CHANGE_KEYBOARD_CONTROL: u32 = 102;
pub const XCB_GET_KEYBOARD_CONTROL: u32 = 103;
pub const XCB_BELL: u32 = 104;
pub const XCB_CHANGE_POINTER_CONTROL: u32 = 105;
pub const XCB_GET_POINTER_CONTROL: u32 = 106;
pub const XCB_SET_SCREEN_SAVER: u32 = 107;
pub const XCB_GET_SCREEN_SAVER: u32 = 108;
pub const XCB_CHANGE_HOSTS: u32 = 109;
pub const XCB_LIST_HOSTS: u32 = 110;
pub const XCB_SET_ACCESS_CONTROL: u32 = 111;
pub const XCB_SET_CLOSE_DOWN_MODE: u32 = 112;
pub const XCB_KILL_CLIENT: u32 = 113;
pub const XCB_ROTATE_PROPERTIES: u32 = 114;
pub const XCB_FORCE_SCREEN_SAVER: u32 = 115;
pub const XCB_SET_POINTER_MAPPING: u32 = 116;
pub const XCB_GET_POINTER_MAPPING: u32 = 117;
pub const XCB_SET_MODIFIER_MAPPING: u32 = 118;
pub const XCB_GET_MODIFIER_MAPPING: u32 = 119;
pub const XCB_NO_OPERATION: u32 = 127;
pub const XCB_NONE: u32 = 0;
pub const XCB_COPY_FROM_PARENT: u32 = 0;
pub const XCB_CURRENT_TIME: u32 = 0;
pub const XCB_NO_SYMBOL: u32 = 0;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulong;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        16usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        8usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_sec as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<timespec>())).tv_nsec as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        8usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_rwlock_arch_t() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_rwlock_arch_t>(),
        56usize,
        concat!("Size of: ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_rwlock_arch_t>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_rwlock_arch_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__readers as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__readers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__wrphase_futex as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__wrphase_futex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__writers_futex as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__writers_futex)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad4 as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__cur_writer as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__cur_writer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__shared as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__rwelision as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__rwelision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad1 as *const _ as usize },
        33usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__pad2 as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_rwlock_arch_t>())).__flags as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_rwlock_arch_t),
            "::",
            stringify!(__flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[test]
fn bindgen_test_layout___pthread_internal_list() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_list>(),
        16usize,
        concat!("Size of: ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_list>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_internal_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_list),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[test]
fn bindgen_test_layout___pthread_mutex_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_mutex_s>(),
        40usize,
        concat!("Size of: ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_mutex_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_mutex_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__elision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_mutex_s),
            "::",
            stringify!(__list)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __bindgen_anon_1: __pthread_cond_s__bindgen_ty_1,
    pub __bindgen_anon_2: __pthread_cond_s__bindgen_ty_2,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_1 {
    pub __wseq: ::std::os::raw::c_ulonglong,
    pub __wseq32: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_1>())).__wseq32 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_1),
            "::",
            stringify!(__wseq32)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __pthread_cond_s__bindgen_ty_2 {
    pub __g1_start: ::std::os::raw::c_ulonglong,
    pub __g1_start32: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1,
    _bindgen_union_align: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__low
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__low)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2__bindgen_ty_1>())).__high
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2__bindgen_ty_1),
            "::",
            stringify!(__high)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Size of: ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s__bindgen_ty_2>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s__bindgen_ty_2))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<__pthread_cond_s__bindgen_ty_2>())).__g1_start32 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s__bindgen_ty_2),
            "::",
            stringify!(__g1_start32)
        )
    );
}
#[test]
fn bindgen_test_layout___pthread_cond_s() {
    assert_eq!(
        ::std::mem::size_of::<__pthread_cond_s>(),
        48usize,
        concat!("Size of: ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_cond_s>(),
        8usize,
        concat!("Alignment of ", stringify!(__pthread_cond_s))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_refs as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_refs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g1_orig_size as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g1_orig_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__wrefs as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__wrefs)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__pthread_cond_s>())).__g_signals as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_cond_s),
            "::",
            stringify!(__g_signals)
        )
    );
}
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutexattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_condattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_attr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 5usize],
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        40usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
    _bindgen_union_align: [u64; 6usize],
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_cond_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 7usize],
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        56usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__data as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlock_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_rwlockattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
    _bindgen_union_align: [u64; 4usize],
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrier_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
    _bindgen_union_align: u32,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pthread_barrierattr_t>())).__align as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
pub type float_t = f32;
pub type double_t = f64;
extern "C" {
    pub fn __fpclassify(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __signbit(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isinf(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __finite(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isnan(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __iseqsig(__x: f64, __y: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __issignaling(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn acos(__x: f64) -> f64;
}
extern "C" {
    pub fn __acos(__x: f64) -> f64;
}
extern "C" {
    pub fn asin(__x: f64) -> f64;
}
extern "C" {
    pub fn __asin(__x: f64) -> f64;
}
extern "C" {
    pub fn atan(__x: f64) -> f64;
}
extern "C" {
    pub fn __atan(__x: f64) -> f64;
}
extern "C" {
    pub fn atan2(__y: f64, __x: f64) -> f64;
}
extern "C" {
    pub fn __atan2(__y: f64, __x: f64) -> f64;
}
extern "C" {
    pub fn cos(__x: f64) -> f64;
}
extern "C" {
    pub fn __cos(__x: f64) -> f64;
}
extern "C" {
    pub fn sin(__x: f64) -> f64;
}
extern "C" {
    pub fn __sin(__x: f64) -> f64;
}
extern "C" {
    pub fn tan(__x: f64) -> f64;
}
extern "C" {
    pub fn __tan(__x: f64) -> f64;
}
extern "C" {
    pub fn cosh(__x: f64) -> f64;
}
extern "C" {
    pub fn __cosh(__x: f64) -> f64;
}
extern "C" {
    pub fn sinh(__x: f64) -> f64;
}
extern "C" {
    pub fn __sinh(__x: f64) -> f64;
}
extern "C" {
    pub fn tanh(__x: f64) -> f64;
}
extern "C" {
    pub fn __tanh(__x: f64) -> f64;
}
extern "C" {
    pub fn acosh(__x: f64) -> f64;
}
extern "C" {
    pub fn __acosh(__x: f64) -> f64;
}
extern "C" {
    pub fn asinh(__x: f64) -> f64;
}
extern "C" {
    pub fn __asinh(__x: f64) -> f64;
}
extern "C" {
    pub fn atanh(__x: f64) -> f64;
}
extern "C" {
    pub fn __atanh(__x: f64) -> f64;
}
extern "C" {
    pub fn exp(__x: f64) -> f64;
}
extern "C" {
    pub fn __exp(__x: f64) -> f64;
}
extern "C" {
    pub fn frexp(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __frexp(__x: f64, __exponent: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn ldexp(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __ldexp(__x: f64, __exponent: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn log(__x: f64) -> f64;
}
extern "C" {
    pub fn __log(__x: f64) -> f64;
}
extern "C" {
    pub fn log10(__x: f64) -> f64;
}
extern "C" {
    pub fn __log10(__x: f64) -> f64;
}
extern "C" {
    pub fn modf(__x: f64, __iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn __modf(__x: f64, __iptr: *mut f64) -> f64;
}
extern "C" {
    pub fn expm1(__x: f64) -> f64;
}
extern "C" {
    pub fn __expm1(__x: f64) -> f64;
}
extern "C" {
    pub fn log1p(__x: f64) -> f64;
}
extern "C" {
    pub fn __log1p(__x: f64) -> f64;
}
extern "C" {
    pub fn logb(__x: f64) -> f64;
}
extern "C" {
    pub fn __logb(__x: f64) -> f64;
}
extern "C" {
    pub fn exp2(__x: f64) -> f64;
}
extern "C" {
    pub fn __exp2(__x: f64) -> f64;
}
extern "C" {
    pub fn log2(__x: f64) -> f64;
}
extern "C" {
    pub fn __log2(__x: f64) -> f64;
}
extern "C" {
    pub fn pow(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __pow(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn sqrt(__x: f64) -> f64;
}
extern "C" {
    pub fn __sqrt(__x: f64) -> f64;
}
extern "C" {
    pub fn hypot(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __hypot(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn cbrt(__x: f64) -> f64;
}
extern "C" {
    pub fn __cbrt(__x: f64) -> f64;
}
extern "C" {
    pub fn ceil(__x: f64) -> f64;
}
extern "C" {
    pub fn __ceil(__x: f64) -> f64;
}
extern "C" {
    pub fn fabs(__x: f64) -> f64;
}
extern "C" {
    pub fn __fabs(__x: f64) -> f64;
}
extern "C" {
    pub fn floor(__x: f64) -> f64;
}
extern "C" {
    pub fn __floor(__x: f64) -> f64;
}
extern "C" {
    pub fn fmod(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmod(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn isinf(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn finite(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drem(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __drem(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn significand(__x: f64) -> f64;
}
extern "C" {
    pub fn __significand(__x: f64) -> f64;
}
extern "C" {
    pub fn copysign(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __copysign(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nan(__tagb: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn __nan(__tagb: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn isnan(__value: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn __j0(arg1: f64) -> f64;
}
extern "C" {
    pub fn j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn __j1(arg1: f64) -> f64;
}
extern "C" {
    pub fn jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn __jn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn __y0(arg1: f64) -> f64;
}
extern "C" {
    pub fn y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn __y1(arg1: f64) -> f64;
}
extern "C" {
    pub fn yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn __yn(arg1: ::std::os::raw::c_int, arg2: f64) -> f64;
}
extern "C" {
    pub fn erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn __erf(arg1: f64) -> f64;
}
extern "C" {
    pub fn erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn __erfc(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __lgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __tgamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn gamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn __gamma(arg1: f64) -> f64;
}
extern "C" {
    pub fn lgamma_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __lgamma_r(arg1: f64, __signgamp: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn rint(__x: f64) -> f64;
}
extern "C" {
    pub fn __rint(__x: f64) -> f64;
}
extern "C" {
    pub fn nextafter(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __nextafter(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn nexttoward(__x: f64, __y: u128) -> f64;
}
extern "C" {
    pub fn __nexttoward(__x: f64, __y: u128) -> f64;
}
extern "C" {
    pub fn remainder(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __remainder(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn scalbn(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __scalbn(__x: f64, __n: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn ilogb(__x: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __ilogb(__x: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scalbln(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
extern "C" {
    pub fn __scalbln(__x: f64, __n: ::std::os::raw::c_long) -> f64;
}
extern "C" {
    pub fn nearbyint(__x: f64) -> f64;
}
extern "C" {
    pub fn __nearbyint(__x: f64) -> f64;
}
extern "C" {
    pub fn round(__x: f64) -> f64;
}
extern "C" {
    pub fn __round(__x: f64) -> f64;
}
extern "C" {
    pub fn trunc(__x: f64) -> f64;
}
extern "C" {
    pub fn __trunc(__x: f64) -> f64;
}
extern "C" {
    pub fn remquo(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn __remquo(__x: f64, __y: f64, __quo: *mut ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn lrint(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lrint(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llrint(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llrint(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn lround(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lround(__x: f64) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llround(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llround(__x: f64) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn fdim(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fdim(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fmax(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmax(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fmin(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn __fmin(__x: f64, __y: f64) -> f64;
}
extern "C" {
    pub fn fma(__x: f64, __y: f64, __z: f64) -> f64;
}
extern "C" {
    pub fn __fma(__x: f64, __y: f64, __z: f64) -> f64;
}
extern "C" {
    pub fn scalb(__x: f64, __n: f64) -> f64;
}
extern "C" {
    pub fn __scalb(__x: f64, __n: f64) -> f64;
}
extern "C" {
    pub fn __fpclassifyf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __signbitf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isinff(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __finitef(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isnanf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __iseqsigf(__x: f32, __y: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __issignalingf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn acosf(__x: f32) -> f32;
}
extern "C" {
    pub fn __acosf(__x: f32) -> f32;
}
extern "C" {
    pub fn asinf(__x: f32) -> f32;
}
extern "C" {
    pub fn __asinf(__x: f32) -> f32;
}
extern "C" {
    pub fn atanf(__x: f32) -> f32;
}
extern "C" {
    pub fn __atanf(__x: f32) -> f32;
}
extern "C" {
    pub fn atan2f(__y: f32, __x: f32) -> f32;
}
extern "C" {
    pub fn __atan2f(__y: f32, __x: f32) -> f32;
}
extern "C" {
    pub fn cosf(__x: f32) -> f32;
}
extern "C" {
    pub fn __cosf(__x: f32) -> f32;
}
extern "C" {
    pub fn sinf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sinf(__x: f32) -> f32;
}
extern "C" {
    pub fn tanf(__x: f32) -> f32;
}
extern "C" {
    pub fn __tanf(__x: f32) -> f32;
}
extern "C" {
    pub fn coshf(__x: f32) -> f32;
}
extern "C" {
    pub fn __coshf(__x: f32) -> f32;
}
extern "C" {
    pub fn sinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn tanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __tanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn acoshf(__x: f32) -> f32;
}
extern "C" {
    pub fn __acoshf(__x: f32) -> f32;
}
extern "C" {
    pub fn asinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __asinhf(__x: f32) -> f32;
}
extern "C" {
    pub fn atanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn __atanhf(__x: f32) -> f32;
}
extern "C" {
    pub fn expf(__x: f32) -> f32;
}
extern "C" {
    pub fn __expf(__x: f32) -> f32;
}
extern "C" {
    pub fn frexpf(__x: f32, __exponent: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __frexpf(__x: f32, __exponent: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn ldexpf(__x: f32, __exponent: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __ldexpf(__x: f32, __exponent: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn logf(__x: f32) -> f32;
}
extern "C" {
    pub fn __logf(__x: f32) -> f32;
}
extern "C" {
    pub fn log10f(__x: f32) -> f32;
}
extern "C" {
    pub fn __log10f(__x: f32) -> f32;
}
extern "C" {
    pub fn modff(__x: f32, __iptr: *mut f32) -> f32;
}
extern "C" {
    pub fn __modff(__x: f32, __iptr: *mut f32) -> f32;
}
extern "C" {
    pub fn expm1f(__x: f32) -> f32;
}
extern "C" {
    pub fn __expm1f(__x: f32) -> f32;
}
extern "C" {
    pub fn log1pf(__x: f32) -> f32;
}
extern "C" {
    pub fn __log1pf(__x: f32) -> f32;
}
extern "C" {
    pub fn logbf(__x: f32) -> f32;
}
extern "C" {
    pub fn __logbf(__x: f32) -> f32;
}
extern "C" {
    pub fn exp2f(__x: f32) -> f32;
}
extern "C" {
    pub fn __exp2f(__x: f32) -> f32;
}
extern "C" {
    pub fn log2f(__x: f32) -> f32;
}
extern "C" {
    pub fn __log2f(__x: f32) -> f32;
}
extern "C" {
    pub fn powf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __powf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn sqrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn __sqrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn hypotf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __hypotf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn cbrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn __cbrtf(__x: f32) -> f32;
}
extern "C" {
    pub fn ceilf(__x: f32) -> f32;
}
extern "C" {
    pub fn __ceilf(__x: f32) -> f32;
}
extern "C" {
    pub fn fabsf(__x: f32) -> f32;
}
extern "C" {
    pub fn __fabsf(__x: f32) -> f32;
}
extern "C" {
    pub fn floorf(__x: f32) -> f32;
}
extern "C" {
    pub fn __floorf(__x: f32) -> f32;
}
extern "C" {
    pub fn fmodf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fmodf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn isinff(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn finitef(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dremf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __dremf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn significandf(__x: f32) -> f32;
}
extern "C" {
    pub fn __significandf(__x: f32) -> f32;
}
extern "C" {
    pub fn copysignf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __copysignf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn nanf(__tagb: *const ::std::os::raw::c_char) -> f32;
}
extern "C" {
    pub fn __nanf(__tagb: *const ::std::os::raw::c_char) -> f32;
}
extern "C" {
    pub fn isnanf(__value: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __j0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __j1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn __jnf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __y0f(arg1: f32) -> f32;
}
extern "C" {
    pub fn y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn __y1f(arg1: f32) -> f32;
}
extern "C" {
    pub fn ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn __ynf(arg1: ::std::os::raw::c_int, arg2: f32) -> f32;
}
extern "C" {
    pub fn erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn __erff(arg1: f32) -> f32;
}
extern "C" {
    pub fn erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __erfcf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __lgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __tgammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn gammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn __gammaf(arg1: f32) -> f32;
}
extern "C" {
    pub fn lgammaf_r(arg1: f32, __signgamp: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __lgammaf_r(arg1: f32, __signgamp: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn rintf(__x: f32) -> f32;
}
extern "C" {
    pub fn __rintf(__x: f32) -> f32;
}
extern "C" {
    pub fn nextafterf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __nextafterf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn nexttowardf(__x: f32, __y: u128) -> f32;
}
extern "C" {
    pub fn __nexttowardf(__x: f32, __y: u128) -> f32;
}
extern "C" {
    pub fn remainderf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __remainderf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn scalbnf(__x: f32, __n: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __scalbnf(__x: f32, __n: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn ilogbf(__x: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __ilogbf(__x: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scalblnf(__x: f32, __n: ::std::os::raw::c_long) -> f32;
}
extern "C" {
    pub fn __scalblnf(__x: f32, __n: ::std::os::raw::c_long) -> f32;
}
extern "C" {
    pub fn nearbyintf(__x: f32) -> f32;
}
extern "C" {
    pub fn __nearbyintf(__x: f32) -> f32;
}
extern "C" {
    pub fn roundf(__x: f32) -> f32;
}
extern "C" {
    pub fn __roundf(__x: f32) -> f32;
}
extern "C" {
    pub fn truncf(__x: f32) -> f32;
}
extern "C" {
    pub fn __truncf(__x: f32) -> f32;
}
extern "C" {
    pub fn remquof(__x: f32, __y: f32, __quo: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn __remquof(__x: f32, __y: f32, __quo: *mut ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn lrintf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lrintf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llrintf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llrintf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn lroundf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lroundf(__x: f32) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llroundf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llroundf(__x: f32) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn fdimf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fdimf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fmaxf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fmaxf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fminf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn __fminf(__x: f32, __y: f32) -> f32;
}
extern "C" {
    pub fn fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
extern "C" {
    pub fn __fmaf(__x: f32, __y: f32, __z: f32) -> f32;
}
extern "C" {
    pub fn scalbf(__x: f32, __n: f32) -> f32;
}
extern "C" {
    pub fn __scalbf(__x: f32, __n: f32) -> f32;
}
extern "C" {
    pub fn __fpclassifyl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __signbitl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isinfl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __finitel(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __isnanl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __iseqsigl(__x: u128, __y: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __issignalingl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn acosl(__x: u128) -> u128;
}
extern "C" {
    pub fn __acosl(__x: u128) -> u128;
}
extern "C" {
    pub fn asinl(__x: u128) -> u128;
}
extern "C" {
    pub fn __asinl(__x: u128) -> u128;
}
extern "C" {
    pub fn atanl(__x: u128) -> u128;
}
extern "C" {
    pub fn __atanl(__x: u128) -> u128;
}
extern "C" {
    pub fn atan2l(__y: u128, __x: u128) -> u128;
}
extern "C" {
    pub fn __atan2l(__y: u128, __x: u128) -> u128;
}
extern "C" {
    pub fn cosl(__x: u128) -> u128;
}
extern "C" {
    pub fn __cosl(__x: u128) -> u128;
}
extern "C" {
    pub fn sinl(__x: u128) -> u128;
}
extern "C" {
    pub fn __sinl(__x: u128) -> u128;
}
extern "C" {
    pub fn tanl(__x: u128) -> u128;
}
extern "C" {
    pub fn __tanl(__x: u128) -> u128;
}
extern "C" {
    pub fn coshl(__x: u128) -> u128;
}
extern "C" {
    pub fn __coshl(__x: u128) -> u128;
}
extern "C" {
    pub fn sinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __sinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn tanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __tanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn acoshl(__x: u128) -> u128;
}
extern "C" {
    pub fn __acoshl(__x: u128) -> u128;
}
extern "C" {
    pub fn asinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __asinhl(__x: u128) -> u128;
}
extern "C" {
    pub fn atanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn __atanhl(__x: u128) -> u128;
}
extern "C" {
    pub fn expl(__x: u128) -> u128;
}
extern "C" {
    pub fn __expl(__x: u128) -> u128;
}
extern "C" {
    pub fn frexpl(__x: u128, __exponent: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn __frexpl(__x: u128, __exponent: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn ldexpl(__x: u128, __exponent: ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn __ldexpl(__x: u128, __exponent: ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn logl(__x: u128) -> u128;
}
extern "C" {
    pub fn __logl(__x: u128) -> u128;
}
extern "C" {
    pub fn log10l(__x: u128) -> u128;
}
extern "C" {
    pub fn __log10l(__x: u128) -> u128;
}
extern "C" {
    pub fn modfl(__x: u128, __iptr: *mut u128) -> u128;
}
extern "C" {
    pub fn __modfl(__x: u128, __iptr: *mut u128) -> u128;
}
extern "C" {
    pub fn expm1l(__x: u128) -> u128;
}
extern "C" {
    pub fn __expm1l(__x: u128) -> u128;
}
extern "C" {
    pub fn log1pl(__x: u128) -> u128;
}
extern "C" {
    pub fn __log1pl(__x: u128) -> u128;
}
extern "C" {
    pub fn logbl(__x: u128) -> u128;
}
extern "C" {
    pub fn __logbl(__x: u128) -> u128;
}
extern "C" {
    pub fn exp2l(__x: u128) -> u128;
}
extern "C" {
    pub fn __exp2l(__x: u128) -> u128;
}
extern "C" {
    pub fn log2l(__x: u128) -> u128;
}
extern "C" {
    pub fn __log2l(__x: u128) -> u128;
}
extern "C" {
    pub fn powl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __powl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn sqrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn __sqrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn hypotl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __hypotl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn cbrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn __cbrtl(__x: u128) -> u128;
}
extern "C" {
    pub fn ceill(__x: u128) -> u128;
}
extern "C" {
    pub fn __ceill(__x: u128) -> u128;
}
extern "C" {
    pub fn fabsl(__x: u128) -> u128;
}
extern "C" {
    pub fn __fabsl(__x: u128) -> u128;
}
extern "C" {
    pub fn floorl(__x: u128) -> u128;
}
extern "C" {
    pub fn __floorl(__x: u128) -> u128;
}
extern "C" {
    pub fn fmodl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fmodl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn isinfl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn finitel(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dreml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __dreml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn significandl(__x: u128) -> u128;
}
extern "C" {
    pub fn __significandl(__x: u128) -> u128;
}
extern "C" {
    pub fn copysignl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __copysignl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn nanl(__tagb: *const ::std::os::raw::c_char) -> u128;
}
extern "C" {
    pub fn __nanl(__tagb: *const ::std::os::raw::c_char) -> u128;
}
extern "C" {
    pub fn isnanl(__value: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn j0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __j0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn j1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __j1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn jnl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn __jnl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn y0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __y0l(arg1: u128) -> u128;
}
extern "C" {
    pub fn y1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn __y1l(arg1: u128) -> u128;
}
extern "C" {
    pub fn ynl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn __ynl(arg1: ::std::os::raw::c_int, arg2: u128) -> u128;
}
extern "C" {
    pub fn erfl(arg1: u128) -> u128;
}
extern "C" {
    pub fn __erfl(arg1: u128) -> u128;
}
extern "C" {
    pub fn erfcl(arg1: u128) -> u128;
}
extern "C" {
    pub fn __erfcl(arg1: u128) -> u128;
}
extern "C" {
    pub fn lgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn __lgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn tgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn __tgammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn gammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn __gammal(arg1: u128) -> u128;
}
extern "C" {
    pub fn lgammal_r(arg1: u128, __signgamp: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn __lgammal_r(arg1: u128, __signgamp: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn rintl(__x: u128) -> u128;
}
extern "C" {
    pub fn __rintl(__x: u128) -> u128;
}
extern "C" {
    pub fn nextafterl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __nextafterl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn nexttowardl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __nexttowardl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn remainderl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __remainderl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn scalbnl(__x: u128, __n: ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn __scalbnl(__x: u128, __n: ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn ilogbl(__x: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __ilogbl(__x: u128) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scalblnl(__x: u128, __n: ::std::os::raw::c_long) -> u128;
}
extern "C" {
    pub fn __scalblnl(__x: u128, __n: ::std::os::raw::c_long) -> u128;
}
extern "C" {
    pub fn nearbyintl(__x: u128) -> u128;
}
extern "C" {
    pub fn __nearbyintl(__x: u128) -> u128;
}
extern "C" {
    pub fn roundl(__x: u128) -> u128;
}
extern "C" {
    pub fn __roundl(__x: u128) -> u128;
}
extern "C" {
    pub fn truncl(__x: u128) -> u128;
}
extern "C" {
    pub fn __truncl(__x: u128) -> u128;
}
extern "C" {
    pub fn remquol(__x: u128, __y: u128, __quo: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn __remquol(__x: u128, __y: u128, __quo: *mut ::std::os::raw::c_int) -> u128;
}
extern "C" {
    pub fn lrintl(__x: u128) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lrintl(__x: u128) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llrintl(__x: u128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llrintl(__x: u128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn lroundl(__x: u128) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn __lroundl(__x: u128) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llroundl(__x: u128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn __llroundl(__x: u128) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn fdiml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fdiml(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn fmaxl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fmaxl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn fminl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn __fminl(__x: u128, __y: u128) -> u128;
}
extern "C" {
    pub fn fmal(__x: u128, __y: u128, __z: u128) -> u128;
}
extern "C" {
    pub fn __fmal(__x: u128, __y: u128, __z: u128) -> u128;
}
extern "C" {
    pub fn scalbl(__x: u128, __n: u128) -> u128;
}
extern "C" {
    pub fn __scalbl(__x: u128, __n: u128) -> u128;
}
extern "C" {
    pub static mut signgam: ::std::os::raw::c_int;
}
pub mod _bindgen_ty_1 {
    pub type Type = u32;
    pub const FP_NAN: Type = 0;
    pub const FP_INFINITE: Type = 1;
    pub const FP_ZERO: Type = 2;
    pub const FP_SUBNORMAL: Type = 3;
    pub const FP_NORMAL: Type = 4;
}
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_imaxdiv_t() {
    assert_eq!(
        ::std::mem::size_of::<imaxdiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<imaxdiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(imaxdiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<imaxdiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(imaxdiv_t),
            "::",
            stringify!(rem)
        )
    );
}
extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub type va_list = __builtin_va_list;
pub type __gnuc_va_list = __builtin_va_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_message {
    pub name: *const ::std::os::raw::c_char,
    pub signature: *const ::std::os::raw::c_char,
    pub types: *mut *const wl_interface,
}
#[test]
fn bindgen_test_layout_wl_message() {
    assert_eq!(
        ::std::mem::size_of::<wl_message>(),
        24usize,
        concat!("Size of: ", stringify!(wl_message))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_message>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_message))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_message>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_message),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_message>())).signature as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_message),
            "::",
            stringify!(signature)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_message>())).types as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_message),
            "::",
            stringify!(types)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_interface {
    pub name: *const ::std::os::raw::c_char,
    pub version: ::std::os::raw::c_int,
    pub method_count: ::std::os::raw::c_int,
    pub methods: *const wl_message,
    pub event_count: ::std::os::raw::c_int,
    pub events: *const wl_message,
}
#[test]
fn bindgen_test_layout_wl_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_interface>(),
        40usize,
        concat!("Size of: ", stringify!(wl_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_interface>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_interface),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_interface>())).version as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_interface),
            "::",
            stringify!(version)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_interface>())).method_count as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_interface),
            "::",
            stringify!(method_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_interface>())).methods as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_interface),
            "::",
            stringify!(methods)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_interface>())).event_count as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_interface),
            "::",
            stringify!(event_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_interface>())).events as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_interface),
            "::",
            stringify!(events)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_list {
    pub prev: *mut wl_list,
    pub next: *mut wl_list,
}
#[test]
fn bindgen_test_layout_wl_list() {
    assert_eq!(
        ::std::mem::size_of::<wl_list>(),
        16usize,
        concat!("Size of: ", stringify!(wl_list))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_list>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_list))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_list>())).prev as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_list),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_list>())).next as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_list),
            "::",
            stringify!(next)
        )
    );
}
extern "C" {
    pub fn wl_list_init(list: *mut wl_list);
}
extern "C" {
    pub fn wl_list_insert(list: *mut wl_list, elm: *mut wl_list);
}
extern "C" {
    pub fn wl_list_remove(elm: *mut wl_list);
}
extern "C" {
    pub fn wl_list_length(list: *const wl_list) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wl_list_empty(list: *const wl_list) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wl_list_insert_list(list: *mut wl_list, other: *mut wl_list);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_array {
    pub size: usize,
    pub alloc: usize,
    pub data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_wl_array() {
    assert_eq!(
        ::std::mem::size_of::<wl_array>(),
        24usize,
        concat!("Size of: ", stringify!(wl_array))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_array>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_array))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_array>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_array),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_array>())).alloc as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_array),
            "::",
            stringify!(alloc)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_array>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_array),
            "::",
            stringify!(data)
        )
    );
}
extern "C" {
    pub fn wl_array_init(array: *mut wl_array);
}
extern "C" {
    pub fn wl_array_release(array: *mut wl_array);
}
extern "C" {
    pub fn wl_array_add(array: *mut wl_array, size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn wl_array_copy(array: *mut wl_array, source: *mut wl_array) -> ::std::os::raw::c_int;
}
pub type wl_fixed_t = i32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union wl_argument {
    pub i: i32,
    pub u: u32,
    pub f: wl_fixed_t,
    pub s: *const ::std::os::raw::c_char,
    pub o: *mut wl_object,
    pub n: u32,
    pub a: *mut wl_array,
    pub h: i32,
    _bindgen_union_align: u64,
}
#[test]
fn bindgen_test_layout_wl_argument() {
    assert_eq!(
        ::std::mem::size_of::<wl_argument>(),
        8usize,
        concat!("Size of: ", stringify!(wl_argument))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_argument>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_argument))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_argument>())).i as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_argument),
            "::",
            stringify!(i)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_argument>())).u as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_argument),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_argument>())).f as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_argument),
            "::",
            stringify!(f)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_argument>())).s as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_argument),
            "::",
            stringify!(s)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_argument>())).o as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_argument),
            "::",
            stringify!(o)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_argument>())).n as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_argument),
            "::",
            stringify!(n)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_argument>())).a as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_argument),
            "::",
            stringify!(a)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_argument>())).h as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_argument),
            "::",
            stringify!(h)
        )
    );
}
pub type wl_dispatcher_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *mut ::std::os::raw::c_void,
        arg3: u32,
        arg4: *const wl_message,
        arg5: *mut wl_argument,
    ) -> ::std::os::raw::c_int,
>;
pub type wl_log_func_t = ::std::option::Option<
    unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char, arg2: *mut __va_list_tag),
>;
pub mod wl_iterator_result {
    pub type Type = u32;
    pub const WL_ITERATOR_STOP: Type = 0;
    pub const WL_ITERATOR_CONTINUE: Type = 1;
}
pub mod _bindgen_ty_2 {
    pub type Type = u32;
    pub const WL_EVENT_READABLE: Type = 1;
    pub const WL_EVENT_WRITABLE: Type = 2;
    pub const WL_EVENT_HANGUP: Type = 4;
    pub const WL_EVENT_ERROR: Type = 8;
}
pub type wl_event_loop_fd_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        fd: ::std::os::raw::c_int,
        mask: u32,
        data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type wl_event_loop_timer_func_t = ::std::option::Option<
    unsafe extern "C" fn(data: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type wl_event_loop_signal_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        signal_number: ::std::os::raw::c_int,
        data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type wl_event_loop_idle_func_t =
    ::std::option::Option<unsafe extern "C" fn(data: *mut ::std::os::raw::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_event_loop {
    _unused: [u8; 0],
}
extern "C" {
    pub fn wl_event_loop_create() -> *mut wl_event_loop;
}
extern "C" {
    pub fn wl_event_loop_destroy(loop_: *mut wl_event_loop);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_event_source {
    _unused: [u8; 0],
}
extern "C" {
    pub fn wl_event_loop_add_fd(
        loop_: *mut wl_event_loop,
        fd: ::std::os::raw::c_int,
        mask: u32,
        func: wl_event_loop_fd_func_t,
        data: *mut ::std::os::raw::c_void,
    ) -> *mut wl_event_source;
}
extern "C" {
    pub fn wl_event_source_fd_update(
        source: *mut wl_event_source,
        mask: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wl_event_loop_add_timer(
        loop_: *mut wl_event_loop,
        func: wl_event_loop_timer_func_t,
        data: *mut ::std::os::raw::c_void,
    ) -> *mut wl_event_source;
}
extern "C" {
    pub fn wl_event_loop_add_signal(
        loop_: *mut wl_event_loop,
        signal_number: ::std::os::raw::c_int,
        func: wl_event_loop_signal_func_t,
        data: *mut ::std::os::raw::c_void,
    ) -> *mut wl_event_source;
}
extern "C" {
    pub fn wl_event_source_timer_update(
        source: *mut wl_event_source,
        ms_delay: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wl_event_source_remove(source: *mut wl_event_source) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wl_event_source_check(source: *mut wl_event_source);
}
extern "C" {
    pub fn wl_event_loop_dispatch(
        loop_: *mut wl_event_loop,
        timeout: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wl_event_loop_dispatch_idle(loop_: *mut wl_event_loop);
}
extern "C" {
    pub fn wl_event_loop_add_idle(
        loop_: *mut wl_event_loop,
        func: wl_event_loop_idle_func_t,
        data: *mut ::std::os::raw::c_void,
    ) -> *mut wl_event_source;
}
extern "C" {
    pub fn wl_event_loop_get_fd(loop_: *mut wl_event_loop) -> ::std::os::raw::c_int;
}
pub type wl_notify_func_t = ::std::option::Option<
    unsafe extern "C" fn(listener: *mut wl_listener, data: *mut ::std::os::raw::c_void),
>;
extern "C" {
    pub fn wl_event_loop_add_destroy_listener(
        loop_: *mut wl_event_loop,
        listener: *mut wl_listener,
    );
}
extern "C" {
    pub fn wl_event_loop_get_destroy_listener(
        loop_: *mut wl_event_loop,
        notify: wl_notify_func_t,
    ) -> *mut wl_listener;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_display {
    _unused: [u8; 0],
}
extern "C" {
    pub fn wl_display_create() -> *mut wl_display;
}
extern "C" {
    pub fn wl_display_destroy(display: *mut wl_display);
}
extern "C" {
    pub fn wl_display_get_event_loop(display: *mut wl_display) -> *mut wl_event_loop;
}
extern "C" {
    pub fn wl_display_add_socket(
        display: *mut wl_display,
        name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wl_display_add_socket_auto(display: *mut wl_display) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn wl_display_add_socket_fd(
        display: *mut wl_display,
        sock_fd: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wl_display_terminate(display: *mut wl_display);
}
extern "C" {
    pub fn wl_display_run(display: *mut wl_display);
}
extern "C" {
    pub fn wl_display_flush_clients(display: *mut wl_display);
}
extern "C" {
    pub fn wl_display_destroy_clients(display: *mut wl_display);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_client {
    _unused: [u8; 0],
}
pub type wl_global_bind_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        client: *mut wl_client,
        data: *mut ::std::os::raw::c_void,
        version: u32,
        id: u32,
    ),
>;
extern "C" {
    pub fn wl_display_get_serial(display: *mut wl_display) -> u32;
}
extern "C" {
    pub fn wl_display_next_serial(display: *mut wl_display) -> u32;
}
extern "C" {
    pub fn wl_display_add_destroy_listener(display: *mut wl_display, listener: *mut wl_listener);
}
extern "C" {
    pub fn wl_display_add_client_created_listener(
        display: *mut wl_display,
        listener: *mut wl_listener,
    );
}
extern "C" {
    pub fn wl_display_get_destroy_listener(
        display: *mut wl_display,
        notify: wl_notify_func_t,
    ) -> *mut wl_listener;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_global {
    _unused: [u8; 0],
}
extern "C" {
    pub fn wl_global_create(
        display: *mut wl_display,
        interface: *const wl_interface,
        version: ::std::os::raw::c_int,
        data: *mut ::std::os::raw::c_void,
        bind: wl_global_bind_func_t,
    ) -> *mut wl_global;
}
extern "C" {
    pub fn wl_global_destroy(global: *mut wl_global);
}
pub type wl_display_global_filter_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        client: *const wl_client,
        global: *const wl_global,
        data: *mut ::std::os::raw::c_void,
    ) -> bool,
>;
extern "C" {
    pub fn wl_display_set_global_filter(
        display: *mut wl_display,
        filter: wl_display_global_filter_func_t,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn wl_global_get_interface(global: *const wl_global) -> *const wl_interface;
}
extern "C" {
    pub fn wl_global_get_user_data(global: *const wl_global) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn wl_client_create(display: *mut wl_display, fd: ::std::os::raw::c_int) -> *mut wl_client;
}
extern "C" {
    pub fn wl_display_get_client_list(display: *mut wl_display) -> *mut wl_list;
}
extern "C" {
    pub fn wl_client_get_link(client: *mut wl_client) -> *mut wl_list;
}
extern "C" {
    pub fn wl_client_from_link(link: *mut wl_list) -> *mut wl_client;
}
extern "C" {
    pub fn wl_client_destroy(client: *mut wl_client);
}
extern "C" {
    pub fn wl_client_flush(client: *mut wl_client);
}
extern "C" {
    pub fn wl_client_get_credentials(
        client: *mut wl_client,
        pid: *mut pid_t,
        uid: *mut uid_t,
        gid: *mut gid_t,
    );
}
extern "C" {
    pub fn wl_client_get_fd(client: *mut wl_client) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wl_client_add_destroy_listener(client: *mut wl_client, listener: *mut wl_listener);
}
extern "C" {
    pub fn wl_client_get_destroy_listener(
        client: *mut wl_client,
        notify: wl_notify_func_t,
    ) -> *mut wl_listener;
}
extern "C" {
    pub fn wl_client_get_object(client: *mut wl_client, id: u32) -> *mut wl_resource;
}
extern "C" {
    pub fn wl_client_post_no_memory(client: *mut wl_client);
}
extern "C" {
    pub fn wl_client_add_resource_created_listener(
        client: *mut wl_client,
        listener: *mut wl_listener,
    );
}
pub type wl_client_for_each_resource_iterator_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        resource: *mut wl_resource,
        user_data: *mut ::std::os::raw::c_void,
    ) -> wl_iterator_result::Type,
>;
extern "C" {
    pub fn wl_client_for_each_resource(
        client: *mut wl_client,
        iterator: wl_client_for_each_resource_iterator_func_t,
        user_data: *mut ::std::os::raw::c_void,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_listener {
    pub link: wl_list,
    pub notify: wl_notify_func_t,
}
#[test]
fn bindgen_test_layout_wl_listener() {
    assert_eq!(
        ::std::mem::size_of::<wl_listener>(),
        24usize,
        concat!("Size of: ", stringify!(wl_listener))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_listener>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_listener))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_listener>())).link as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_listener),
            "::",
            stringify!(link)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_listener>())).notify as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_listener),
            "::",
            stringify!(notify)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_signal {
    pub listener_list: wl_list,
}
#[test]
fn bindgen_test_layout_wl_signal() {
    assert_eq!(
        ::std::mem::size_of::<wl_signal>(),
        16usize,
        concat!("Size of: ", stringify!(wl_signal))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_signal>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_signal))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_signal>())).listener_list as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_signal),
            "::",
            stringify!(listener_list)
        )
    );
}
pub type wl_resource_destroy_func_t =
    ::std::option::Option<unsafe extern "C" fn(resource: *mut wl_resource)>;
extern "C" {
    pub fn wl_resource_post_event(resource: *mut wl_resource, opcode: u32, ...);
}
extern "C" {
    pub fn wl_resource_post_event_array(
        resource: *mut wl_resource,
        opcode: u32,
        args: *mut wl_argument,
    );
}
extern "C" {
    pub fn wl_resource_queue_event(resource: *mut wl_resource, opcode: u32, ...);
}
extern "C" {
    pub fn wl_resource_queue_event_array(
        resource: *mut wl_resource,
        opcode: u32,
        args: *mut wl_argument,
    );
}
extern "C" {
    pub fn wl_resource_post_error(
        resource: *mut wl_resource,
        code: u32,
        msg: *const ::std::os::raw::c_char,
        ...
    );
}
extern "C" {
    pub fn wl_resource_post_no_memory(resource: *mut wl_resource);
}
extern "C" {
    pub fn wl_client_get_display(client: *mut wl_client) -> *mut wl_display;
}
extern "C" {
    pub fn wl_resource_create(
        client: *mut wl_client,
        interface: *const wl_interface,
        version: ::std::os::raw::c_int,
        id: u32,
    ) -> *mut wl_resource;
}
extern "C" {
    pub fn wl_resource_set_implementation(
        resource: *mut wl_resource,
        implementation: *const ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
        destroy: wl_resource_destroy_func_t,
    );
}
extern "C" {
    pub fn wl_resource_set_dispatcher(
        resource: *mut wl_resource,
        dispatcher: wl_dispatcher_func_t,
        implementation: *const ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
        destroy: wl_resource_destroy_func_t,
    );
}
extern "C" {
    pub fn wl_resource_destroy(resource: *mut wl_resource);
}
extern "C" {
    pub fn wl_resource_get_id(resource: *mut wl_resource) -> u32;
}
extern "C" {
    pub fn wl_resource_get_link(resource: *mut wl_resource) -> *mut wl_list;
}
extern "C" {
    pub fn wl_resource_from_link(resource: *mut wl_list) -> *mut wl_resource;
}
extern "C" {
    pub fn wl_resource_find_for_client(
        list: *mut wl_list,
        client: *mut wl_client,
    ) -> *mut wl_resource;
}
extern "C" {
    pub fn wl_resource_get_client(resource: *mut wl_resource) -> *mut wl_client;
}
extern "C" {
    pub fn wl_resource_set_user_data(resource: *mut wl_resource, data: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn wl_resource_get_user_data(resource: *mut wl_resource) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn wl_resource_get_version(resource: *mut wl_resource) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wl_resource_set_destructor(
        resource: *mut wl_resource,
        destroy: wl_resource_destroy_func_t,
    );
}
extern "C" {
    pub fn wl_resource_instance_of(
        resource: *mut wl_resource,
        interface: *const wl_interface,
        implementation: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wl_resource_get_class(resource: *mut wl_resource) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn wl_resource_add_destroy_listener(resource: *mut wl_resource, listener: *mut wl_listener);
}
extern "C" {
    pub fn wl_resource_get_destroy_listener(
        resource: *mut wl_resource,
        notify: wl_notify_func_t,
    ) -> *mut wl_listener;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_shm_buffer {
    _unused: [u8; 0],
}
extern "C" {
    pub fn wl_shm_buffer_get(resource: *mut wl_resource) -> *mut wl_shm_buffer;
}
extern "C" {
    pub fn wl_shm_buffer_begin_access(buffer: *mut wl_shm_buffer);
}
extern "C" {
    pub fn wl_shm_buffer_end_access(buffer: *mut wl_shm_buffer);
}
extern "C" {
    pub fn wl_shm_buffer_get_data(buffer: *mut wl_shm_buffer) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn wl_shm_buffer_get_stride(buffer: *mut wl_shm_buffer) -> i32;
}
extern "C" {
    pub fn wl_shm_buffer_get_format(buffer: *mut wl_shm_buffer) -> u32;
}
extern "C" {
    pub fn wl_shm_buffer_get_width(buffer: *mut wl_shm_buffer) -> i32;
}
extern "C" {
    pub fn wl_shm_buffer_get_height(buffer: *mut wl_shm_buffer) -> i32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_shm_pool {
    _unused: [u8; 0],
}
extern "C" {
    pub fn wl_shm_buffer_ref_pool(buffer: *mut wl_shm_buffer) -> *mut wl_shm_pool;
}
extern "C" {
    pub fn wl_shm_pool_unref(pool: *mut wl_shm_pool);
}
extern "C" {
    pub fn wl_display_init_shm(display: *mut wl_display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wl_display_add_shm_format(display: *mut wl_display, format: u32) -> *mut u32;
}
extern "C" {
    pub fn wl_shm_buffer_create(
        client: *mut wl_client,
        id: u32,
        width: i32,
        height: i32,
        stride: i32,
        format: u32,
    ) -> *mut wl_shm_buffer;
}
extern "C" {
    pub fn wl_log_set_handler_server(handler: wl_log_func_t);
}
pub mod wl_protocol_logger_type {
    pub type Type = u32;
    pub const WL_PROTOCOL_LOGGER_REQUEST: Type = 0;
    pub const WL_PROTOCOL_LOGGER_EVENT: Type = 1;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_protocol_logger_message {
    pub resource: *mut wl_resource,
    pub message_opcode: ::std::os::raw::c_int,
    pub message: *const wl_message,
    pub arguments_count: ::std::os::raw::c_int,
    pub arguments: *const wl_argument,
}
#[test]
fn bindgen_test_layout_wl_protocol_logger_message() {
    assert_eq!(
        ::std::mem::size_of::<wl_protocol_logger_message>(),
        40usize,
        concat!("Size of: ", stringify!(wl_protocol_logger_message))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_protocol_logger_message>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_protocol_logger_message))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_protocol_logger_message>())).resource as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_protocol_logger_message),
            "::",
            stringify!(resource)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_protocol_logger_message>())).message_opcode as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_protocol_logger_message),
            "::",
            stringify!(message_opcode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_protocol_logger_message>())).message as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_protocol_logger_message),
            "::",
            stringify!(message)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_protocol_logger_message>())).arguments_count as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_protocol_logger_message),
            "::",
            stringify!(arguments_count)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_protocol_logger_message>())).arguments as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_protocol_logger_message),
            "::",
            stringify!(arguments)
        )
    );
}
pub type wl_protocol_logger_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        user_data: *mut ::std::os::raw::c_void,
        direction: wl_protocol_logger_type::Type,
        message: *const wl_protocol_logger_message,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_protocol_logger {
    _unused: [u8; 0],
}
extern "C" {
    pub fn wl_display_add_protocol_logger(
        display: *mut wl_display,
        arg1: wl_protocol_logger_func_t,
        user_data: *mut ::std::os::raw::c_void,
    ) -> *mut wl_protocol_logger;
}
extern "C" {
    pub fn wl_protocol_logger_destroy(logger: *mut wl_protocol_logger);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_object {
    pub interface: *const wl_interface,
    pub implementation: *const ::std::os::raw::c_void,
    pub id: u32,
}
#[test]
fn bindgen_test_layout_wl_object() {
    assert_eq!(
        ::std::mem::size_of::<wl_object>(),
        24usize,
        concat!("Size of: ", stringify!(wl_object))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_object>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_object))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_object>())).interface as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_object),
            "::",
            stringify!(interface)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_object>())).implementation as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_object),
            "::",
            stringify!(implementation)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_object>())).id as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_object),
            "::",
            stringify!(id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_resource {
    pub object: wl_object,
    pub destroy: wl_resource_destroy_func_t,
    pub link: wl_list,
    pub destroy_signal: wl_signal,
    pub client: *mut wl_client,
    pub data: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_wl_resource() {
    assert_eq!(
        ::std::mem::size_of::<wl_resource>(),
        80usize,
        concat!("Size of: ", stringify!(wl_resource))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_resource>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_resource))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_resource>())).object as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_resource),
            "::",
            stringify!(object)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_resource>())).destroy as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_resource),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_resource>())).link as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_resource),
            "::",
            stringify!(link)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_resource>())).destroy_signal as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_resource),
            "::",
            stringify!(destroy_signal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_resource>())).client as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_resource),
            "::",
            stringify!(client)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_resource>())).data as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_resource),
            "::",
            stringify!(data)
        )
    );
}
extern "C" {
    pub fn wl_client_add_resource(client: *mut wl_client, resource: *mut wl_resource) -> u32;
}
extern "C" {
    pub fn wl_client_add_object(
        client: *mut wl_client,
        interface: *const wl_interface,
        implementation: *const ::std::os::raw::c_void,
        id: u32,
        data: *mut ::std::os::raw::c_void,
    ) -> *mut wl_resource;
}
extern "C" {
    pub fn wl_client_new_object(
        client: *mut wl_client,
        interface: *const wl_interface,
        implementation: *const ::std::os::raw::c_void,
        data: *mut ::std::os::raw::c_void,
    ) -> *mut wl_resource;
}
extern "C" {
    pub fn wl_display_add_global(
        display: *mut wl_display,
        interface: *const wl_interface,
        data: *mut ::std::os::raw::c_void,
        bind: wl_global_bind_func_t,
    ) -> *mut wl_global;
}
extern "C" {
    pub fn wl_display_remove_global(display: *mut wl_display, global: *mut wl_global);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_buffer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_callback {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_compositor {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_data_device {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_data_device_manager {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_data_offer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_data_source {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_keyboard {
    _unused: [u8; 0],
}
#[doc = " @page page_xdg_shell The xdg_shell protocol"]
#[doc = " @section page_ifaces_xdg_shell Interfaces"]
#[doc = " - @subpage page_iface_xdg_wm_base - create desktop-style surfaces"]
#[doc = " - @subpage page_iface_xdg_positioner - child surface positioner"]
#[doc = " - @subpage page_iface_xdg_surface - desktop user interface surface base interface"]
#[doc = " - @subpage page_iface_xdg_toplevel - toplevel surface"]
#[doc = " - @subpage page_iface_xdg_popup - short-lived, popup surfaces for menus"]
#[doc = " @section page_copyright_xdg_shell Copyright"]
#[doc = " <pre>"]
#[doc = ""]
#[doc = " Copyright \u{a9} 2008-2013 Kristian H\u{f8}gsberg"]
#[doc = " Copyright \u{a9} 2013      Rafael Antognolli"]
#[doc = " Copyright \u{a9} 2013      Jasper St. Pierre"]
#[doc = " Copyright \u{a9} 2010-2013 Intel Corporation"]
#[doc = " Copyright \u{a9} 2015-2017 Samsung Electronics Co., Ltd"]
#[doc = " Copyright \u{a9} 2015-2017 Red Hat Inc."]
#[doc = ""]
#[doc = " Permission is hereby granted, free of charge, to any person obtaining a"]
#[doc = " copy of this software and associated documentation files (the \"Software\"),"]
#[doc = " to deal in the Software without restriction, including without limitation"]
#[doc = " the rights to use, copy, modify, merge, publish, distribute, sublicense,"]
#[doc = " and/or sell copies of the Software, and to permit persons to whom the"]
#[doc = " Software is furnished to do so, subject to the following conditions:"]
#[doc = ""]
#[doc = " The above copyright notice and this permission notice (including the next"]
#[doc = " paragraph) shall be included in all copies or substantial portions of the"]
#[doc = " Software."]
#[doc = ""]
#[doc = " THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR"]
#[doc = " IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,"]
#[doc = " FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL"]
#[doc = " THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER"]
#[doc = " LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING"]
#[doc = " FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER"]
#[doc = " DEALINGS IN THE SOFTWARE."]
#[doc = " </pre>"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_output {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_pointer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_region {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_registry {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_seat {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_shell {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_shell_surface {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_shm {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_subcompositor {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_subsurface {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_surface {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_touch {
    _unused: [u8; 0],
}
extern "C" {
    pub static wl_display_interface: wl_interface;
}
extern "C" {
    pub static wl_registry_interface: wl_interface;
}
extern "C" {
    pub static wl_callback_interface: wl_interface;
}
extern "C" {
    pub static wl_compositor_interface: wl_interface;
}
extern "C" {
    pub static wl_shm_pool_interface: wl_interface;
}
extern "C" {
    pub static wl_shm_interface: wl_interface;
}
extern "C" {
    pub static wl_buffer_interface: wl_interface;
}
extern "C" {
    pub static wl_data_offer_interface: wl_interface;
}
extern "C" {
    pub static wl_data_source_interface: wl_interface;
}
extern "C" {
    pub static wl_data_device_interface: wl_interface;
}
extern "C" {
    pub static wl_data_device_manager_interface: wl_interface;
}
extern "C" {
    pub static wl_shell_interface: wl_interface;
}
extern "C" {
    pub static wl_shell_surface_interface: wl_interface;
}
extern "C" {
    pub static wl_surface_interface: wl_interface;
}
extern "C" {
    pub static wl_seat_interface: wl_interface;
}
extern "C" {
    pub static wl_pointer_interface: wl_interface;
}
extern "C" {
    pub static wl_keyboard_interface: wl_interface;
}
extern "C" {
    pub static wl_touch_interface: wl_interface;
}
extern "C" {
    pub static wl_output_interface: wl_interface;
}
extern "C" {
    pub static wl_region_interface: wl_interface;
}
extern "C" {
    pub static wl_subcompositor_interface: wl_interface;
}
extern "C" {
    pub static wl_subsurface_interface: wl_interface;
}
pub mod wl_display_error {
    pub type Type = u32;
    pub const WL_DISPLAY_ERROR_INVALID_OBJECT: Type = 0;
    pub const WL_DISPLAY_ERROR_INVALID_METHOD: Type = 1;
    pub const WL_DISPLAY_ERROR_NO_MEMORY: Type = 2;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_display_interface {
    pub sync: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource, callback: u32),
    >,
    pub get_registry: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource, registry: u32),
    >,
}
#[test]
fn bindgen_test_layout_wl_display_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_display_interface>(),
        16usize,
        concat!("Size of: ", stringify!(wl_display_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_display_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_display_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_display_interface>())).sync as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_display_interface),
            "::",
            stringify!(sync)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_display_interface>())).get_registry as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_display_interface),
            "::",
            stringify!(get_registry)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_registry_interface {
    pub bind: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            name: u32,
            interface: *const ::std::os::raw::c_char,
            version: u32,
            id: u32,
        ),
    >,
}
#[test]
fn bindgen_test_layout_wl_registry_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_registry_interface>(),
        8usize,
        concat!("Size of: ", stringify!(wl_registry_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_registry_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_registry_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_registry_interface>())).bind as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_registry_interface),
            "::",
            stringify!(bind)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_compositor_interface {
    pub create_surface: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource, id: u32),
    >,
    pub create_region: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource, id: u32),
    >,
}
#[test]
fn bindgen_test_layout_wl_compositor_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_compositor_interface>(),
        16usize,
        concat!("Size of: ", stringify!(wl_compositor_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_compositor_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_compositor_interface))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_compositor_interface>())).create_surface as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_compositor_interface),
            "::",
            stringify!(create_surface)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_compositor_interface>())).create_region as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_compositor_interface),
            "::",
            stringify!(create_region)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_shm_pool_interface {
    pub create_buffer: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            id: u32,
            offset: i32,
            width: i32,
            height: i32,
            stride: i32,
            format: u32,
        ),
    >,
    pub destroy: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
    pub resize: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource, size: i32),
    >,
}
#[test]
fn bindgen_test_layout_wl_shm_pool_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_shm_pool_interface>(),
        24usize,
        concat!("Size of: ", stringify!(wl_shm_pool_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_shm_pool_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_shm_pool_interface))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_shm_pool_interface>())).create_buffer as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_shm_pool_interface),
            "::",
            stringify!(create_buffer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_shm_pool_interface>())).destroy as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_shm_pool_interface),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_shm_pool_interface>())).resize as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_shm_pool_interface),
            "::",
            stringify!(resize)
        )
    );
}
pub mod wl_shm_error {
    pub type Type = u32;
    pub const WL_SHM_ERROR_INVALID_FORMAT: Type = 0;
    pub const WL_SHM_ERROR_INVALID_STRIDE: Type = 1;
    pub const WL_SHM_ERROR_INVALID_FD: Type = 2;
}
pub mod wl_shm_format {
    pub type Type = u32;
    pub const WL_SHM_FORMAT_ARGB8888: Type = 0;
    pub const WL_SHM_FORMAT_XRGB8888: Type = 1;
    pub const WL_SHM_FORMAT_C8: Type = 538982467;
    pub const WL_SHM_FORMAT_RGB332: Type = 943867730;
    pub const WL_SHM_FORMAT_BGR233: Type = 944916290;
    pub const WL_SHM_FORMAT_XRGB4444: Type = 842093144;
    pub const WL_SHM_FORMAT_XBGR4444: Type = 842089048;
    pub const WL_SHM_FORMAT_RGBX4444: Type = 842094674;
    pub const WL_SHM_FORMAT_BGRX4444: Type = 842094658;
    pub const WL_SHM_FORMAT_ARGB4444: Type = 842093121;
    pub const WL_SHM_FORMAT_ABGR4444: Type = 842089025;
    pub const WL_SHM_FORMAT_RGBA4444: Type = 842088786;
    pub const WL_SHM_FORMAT_BGRA4444: Type = 842088770;
    pub const WL_SHM_FORMAT_XRGB1555: Type = 892424792;
    pub const WL_SHM_FORMAT_XBGR1555: Type = 892420696;
    pub const WL_SHM_FORMAT_RGBX5551: Type = 892426322;
    pub const WL_SHM_FORMAT_BGRX5551: Type = 892426306;
    pub const WL_SHM_FORMAT_ARGB1555: Type = 892424769;
    pub const WL_SHM_FORMAT_ABGR1555: Type = 892420673;
    pub const WL_SHM_FORMAT_RGBA5551: Type = 892420434;
    pub const WL_SHM_FORMAT_BGRA5551: Type = 892420418;
    pub const WL_SHM_FORMAT_RGB565: Type = 909199186;
    pub const WL_SHM_FORMAT_BGR565: Type = 909199170;
    pub const WL_SHM_FORMAT_RGB888: Type = 875710290;
    pub const WL_SHM_FORMAT_BGR888: Type = 875710274;
    pub const WL_SHM_FORMAT_XBGR8888: Type = 875709016;
    pub const WL_SHM_FORMAT_RGBX8888: Type = 875714642;
    pub const WL_SHM_FORMAT_BGRX8888: Type = 875714626;
    pub const WL_SHM_FORMAT_ABGR8888: Type = 875708993;
    pub const WL_SHM_FORMAT_RGBA8888: Type = 875708754;
    pub const WL_SHM_FORMAT_BGRA8888: Type = 875708738;
    pub const WL_SHM_FORMAT_XRGB2101010: Type = 808669784;
    pub const WL_SHM_FORMAT_XBGR2101010: Type = 808665688;
    pub const WL_SHM_FORMAT_RGBX1010102: Type = 808671314;
    pub const WL_SHM_FORMAT_BGRX1010102: Type = 808671298;
    pub const WL_SHM_FORMAT_ARGB2101010: Type = 808669761;
    pub const WL_SHM_FORMAT_ABGR2101010: Type = 808665665;
    pub const WL_SHM_FORMAT_RGBA1010102: Type = 808665426;
    pub const WL_SHM_FORMAT_BGRA1010102: Type = 808665410;
    pub const WL_SHM_FORMAT_YUYV: Type = 1448695129;
    pub const WL_SHM_FORMAT_YVYU: Type = 1431918169;
    pub const WL_SHM_FORMAT_UYVY: Type = 1498831189;
    pub const WL_SHM_FORMAT_VYUY: Type = 1498765654;
    pub const WL_SHM_FORMAT_AYUV: Type = 1448433985;
    pub const WL_SHM_FORMAT_NV12: Type = 842094158;
    pub const WL_SHM_FORMAT_NV21: Type = 825382478;
    pub const WL_SHM_FORMAT_NV16: Type = 909203022;
    pub const WL_SHM_FORMAT_NV61: Type = 825644622;
    pub const WL_SHM_FORMAT_YUV410: Type = 961959257;
    pub const WL_SHM_FORMAT_YVU410: Type = 961893977;
    pub const WL_SHM_FORMAT_YUV411: Type = 825316697;
    pub const WL_SHM_FORMAT_YVU411: Type = 825316953;
    pub const WL_SHM_FORMAT_YUV420: Type = 842093913;
    pub const WL_SHM_FORMAT_YVU420: Type = 842094169;
    pub const WL_SHM_FORMAT_YUV422: Type = 909202777;
    pub const WL_SHM_FORMAT_YVU422: Type = 909203033;
    pub const WL_SHM_FORMAT_YUV444: Type = 875713881;
    pub const WL_SHM_FORMAT_YVU444: Type = 875714137;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_shm_interface {
    pub create_pool: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            id: u32,
            fd: i32,
            size: i32,
        ),
    >,
}
#[test]
fn bindgen_test_layout_wl_shm_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_shm_interface>(),
        8usize,
        concat!("Size of: ", stringify!(wl_shm_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_shm_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_shm_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_shm_interface>())).create_pool as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_shm_interface),
            "::",
            stringify!(create_pool)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_buffer_interface {
    pub destroy: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
}
#[test]
fn bindgen_test_layout_wl_buffer_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_buffer_interface>(),
        8usize,
        concat!("Size of: ", stringify!(wl_buffer_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_buffer_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_buffer_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_buffer_interface>())).destroy as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_buffer_interface),
            "::",
            stringify!(destroy)
        )
    );
}
pub mod wl_data_offer_error {
    pub type Type = u32;
    pub const WL_DATA_OFFER_ERROR_INVALID_FINISH: Type = 0;
    pub const WL_DATA_OFFER_ERROR_INVALID_ACTION_MASK: Type = 1;
    pub const WL_DATA_OFFER_ERROR_INVALID_ACTION: Type = 2;
    pub const WL_DATA_OFFER_ERROR_INVALID_OFFER: Type = 3;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_data_offer_interface {
    pub accept: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            serial: u32,
            mime_type: *const ::std::os::raw::c_char,
        ),
    >,
    pub receive: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            mime_type: *const ::std::os::raw::c_char,
            fd: i32,
        ),
    >,
    pub destroy: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
    pub finish: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
    pub set_actions: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            dnd_actions: u32,
            preferred_action: u32,
        ),
    >,
}
#[test]
fn bindgen_test_layout_wl_data_offer_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_data_offer_interface>(),
        40usize,
        concat!("Size of: ", stringify!(wl_data_offer_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_data_offer_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_data_offer_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_data_offer_interface>())).accept as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_data_offer_interface),
            "::",
            stringify!(accept)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_data_offer_interface>())).receive as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_data_offer_interface),
            "::",
            stringify!(receive)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_data_offer_interface>())).destroy as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_data_offer_interface),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_data_offer_interface>())).finish as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_data_offer_interface),
            "::",
            stringify!(finish)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_data_offer_interface>())).set_actions as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_data_offer_interface),
            "::",
            stringify!(set_actions)
        )
    );
}
pub mod wl_data_source_error {
    pub type Type = u32;
    pub const WL_DATA_SOURCE_ERROR_INVALID_ACTION_MASK: Type = 0;
    pub const WL_DATA_SOURCE_ERROR_INVALID_SOURCE: Type = 1;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_data_source_interface {
    pub offer: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            mime_type: *const ::std::os::raw::c_char,
        ),
    >,
    pub destroy: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
    pub set_actions: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource, dnd_actions: u32),
    >,
}
#[test]
fn bindgen_test_layout_wl_data_source_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_data_source_interface>(),
        24usize,
        concat!("Size of: ", stringify!(wl_data_source_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_data_source_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_data_source_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_data_source_interface>())).offer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_data_source_interface),
            "::",
            stringify!(offer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_data_source_interface>())).destroy as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_data_source_interface),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_data_source_interface>())).set_actions as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_data_source_interface),
            "::",
            stringify!(set_actions)
        )
    );
}
pub mod wl_data_device_error {
    pub type Type = u32;
    pub const WL_DATA_DEVICE_ERROR_ROLE: Type = 0;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_data_device_interface {
    pub start_drag: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            source: *mut wl_resource,
            origin: *mut wl_resource,
            icon: *mut wl_resource,
            serial: u32,
        ),
    >,
    pub set_selection: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            source: *mut wl_resource,
            serial: u32,
        ),
    >,
    pub release: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
}
#[test]
fn bindgen_test_layout_wl_data_device_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_data_device_interface>(),
        24usize,
        concat!("Size of: ", stringify!(wl_data_device_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_data_device_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_data_device_interface))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_data_device_interface>())).start_drag as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_data_device_interface),
            "::",
            stringify!(start_drag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_data_device_interface>())).set_selection as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_data_device_interface),
            "::",
            stringify!(set_selection)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_data_device_interface>())).release as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_data_device_interface),
            "::",
            stringify!(release)
        )
    );
}
pub mod wl_data_device_manager_dnd_action {
    pub type Type = u32;
    pub const WL_DATA_DEVICE_MANAGER_DND_ACTION_NONE: Type = 0;
    pub const WL_DATA_DEVICE_MANAGER_DND_ACTION_COPY: Type = 1;
    pub const WL_DATA_DEVICE_MANAGER_DND_ACTION_MOVE: Type = 2;
    pub const WL_DATA_DEVICE_MANAGER_DND_ACTION_ASK: Type = 4;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_data_device_manager_interface {
    pub create_data_source: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource, id: u32),
    >,
    pub get_data_device: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            id: u32,
            seat: *mut wl_resource,
        ),
    >,
}
#[test]
fn bindgen_test_layout_wl_data_device_manager_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_data_device_manager_interface>(),
        16usize,
        concat!("Size of: ", stringify!(wl_data_device_manager_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_data_device_manager_interface>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(wl_data_device_manager_interface)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_data_device_manager_interface>())).create_data_source
                as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_data_device_manager_interface),
            "::",
            stringify!(create_data_source)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_data_device_manager_interface>())).get_data_device as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_data_device_manager_interface),
            "::",
            stringify!(get_data_device)
        )
    );
}
pub mod wl_shell_error {
    pub type Type = u32;
    pub const WL_SHELL_ERROR_ROLE: Type = 0;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_shell_interface {
    pub get_shell_surface: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            id: u32,
            surface: *mut wl_resource,
        ),
    >,
}
#[test]
fn bindgen_test_layout_wl_shell_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_shell_interface>(),
        8usize,
        concat!("Size of: ", stringify!(wl_shell_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_shell_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_shell_interface))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_shell_interface>())).get_shell_surface as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_shell_interface),
            "::",
            stringify!(get_shell_surface)
        )
    );
}
pub mod wl_shell_surface_resize {
    pub type Type = u32;
    pub const WL_SHELL_SURFACE_RESIZE_NONE: Type = 0;
    pub const WL_SHELL_SURFACE_RESIZE_TOP: Type = 1;
    pub const WL_SHELL_SURFACE_RESIZE_BOTTOM: Type = 2;
    pub const WL_SHELL_SURFACE_RESIZE_LEFT: Type = 4;
    pub const WL_SHELL_SURFACE_RESIZE_TOP_LEFT: Type = 5;
    pub const WL_SHELL_SURFACE_RESIZE_BOTTOM_LEFT: Type = 6;
    pub const WL_SHELL_SURFACE_RESIZE_RIGHT: Type = 8;
    pub const WL_SHELL_SURFACE_RESIZE_TOP_RIGHT: Type = 9;
    pub const WL_SHELL_SURFACE_RESIZE_BOTTOM_RIGHT: Type = 10;
}
pub mod wl_shell_surface_transient {
    pub type Type = u32;
    pub const WL_SHELL_SURFACE_TRANSIENT_INACTIVE: Type = 1;
}
pub mod wl_shell_surface_fullscreen_method {
    pub type Type = u32;
    pub const WL_SHELL_SURFACE_FULLSCREEN_METHOD_DEFAULT: Type = 0;
    pub const WL_SHELL_SURFACE_FULLSCREEN_METHOD_SCALE: Type = 1;
    pub const WL_SHELL_SURFACE_FULLSCREEN_METHOD_DRIVER: Type = 2;
    pub const WL_SHELL_SURFACE_FULLSCREEN_METHOD_FILL: Type = 3;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_shell_surface_interface {
    pub pong: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource, serial: u32),
    >,
    pub move_: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            seat: *mut wl_resource,
            serial: u32,
        ),
    >,
    pub resize: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            seat: *mut wl_resource,
            serial: u32,
            edges: u32,
        ),
    >,
    pub set_toplevel: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
    pub set_transient: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            parent: *mut wl_resource,
            x: i32,
            y: i32,
            flags: u32,
        ),
    >,
    pub set_fullscreen: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            method: u32,
            framerate: u32,
            output: *mut wl_resource,
        ),
    >,
    pub set_popup: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            seat: *mut wl_resource,
            serial: u32,
            parent: *mut wl_resource,
            x: i32,
            y: i32,
            flags: u32,
        ),
    >,
    pub set_maximized: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            output: *mut wl_resource,
        ),
    >,
    pub set_title: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            title: *const ::std::os::raw::c_char,
        ),
    >,
    pub set_class: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            class_: *const ::std::os::raw::c_char,
        ),
    >,
}
#[test]
fn bindgen_test_layout_wl_shell_surface_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_shell_surface_interface>(),
        80usize,
        concat!("Size of: ", stringify!(wl_shell_surface_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_shell_surface_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_shell_surface_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_shell_surface_interface>())).pong as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_shell_surface_interface),
            "::",
            stringify!(pong)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_shell_surface_interface>())).move_ as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_shell_surface_interface),
            "::",
            stringify!(move_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_shell_surface_interface>())).resize as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_shell_surface_interface),
            "::",
            stringify!(resize)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_shell_surface_interface>())).set_toplevel as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_shell_surface_interface),
            "::",
            stringify!(set_toplevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_shell_surface_interface>())).set_transient as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_shell_surface_interface),
            "::",
            stringify!(set_transient)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_shell_surface_interface>())).set_fullscreen as *const _
                as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_shell_surface_interface),
            "::",
            stringify!(set_fullscreen)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_shell_surface_interface>())).set_popup as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_shell_surface_interface),
            "::",
            stringify!(set_popup)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_shell_surface_interface>())).set_maximized as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_shell_surface_interface),
            "::",
            stringify!(set_maximized)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_shell_surface_interface>())).set_title as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_shell_surface_interface),
            "::",
            stringify!(set_title)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_shell_surface_interface>())).set_class as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_shell_surface_interface),
            "::",
            stringify!(set_class)
        )
    );
}
pub mod wl_surface_error {
    pub type Type = u32;
    pub const WL_SURFACE_ERROR_INVALID_SCALE: Type = 0;
    pub const WL_SURFACE_ERROR_INVALID_TRANSFORM: Type = 1;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_surface_interface {
    pub destroy: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
    pub attach: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            buffer: *mut wl_resource,
            x: i32,
            y: i32,
        ),
    >,
    pub damage: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            x: i32,
            y: i32,
            width: i32,
            height: i32,
        ),
    >,
    pub frame: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource, callback: u32),
    >,
    pub set_opaque_region: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            region: *mut wl_resource,
        ),
    >,
    pub set_input_region: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            region: *mut wl_resource,
        ),
    >,
    pub commit: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
    pub set_buffer_transform: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource, transform: i32),
    >,
    pub set_buffer_scale: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource, scale: i32),
    >,
    pub damage_buffer: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            x: i32,
            y: i32,
            width: i32,
            height: i32,
        ),
    >,
}
#[test]
fn bindgen_test_layout_wl_surface_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_surface_interface>(),
        80usize,
        concat!("Size of: ", stringify!(wl_surface_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_surface_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_surface_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_surface_interface>())).destroy as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_surface_interface),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_surface_interface>())).attach as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_surface_interface),
            "::",
            stringify!(attach)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_surface_interface>())).damage as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_surface_interface),
            "::",
            stringify!(damage)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_surface_interface>())).frame as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_surface_interface),
            "::",
            stringify!(frame)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_surface_interface>())).set_opaque_region as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_surface_interface),
            "::",
            stringify!(set_opaque_region)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_surface_interface>())).set_input_region as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_surface_interface),
            "::",
            stringify!(set_input_region)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_surface_interface>())).commit as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_surface_interface),
            "::",
            stringify!(commit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_surface_interface>())).set_buffer_transform as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_surface_interface),
            "::",
            stringify!(set_buffer_transform)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_surface_interface>())).set_buffer_scale as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_surface_interface),
            "::",
            stringify!(set_buffer_scale)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_surface_interface>())).damage_buffer as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_surface_interface),
            "::",
            stringify!(damage_buffer)
        )
    );
}
pub mod wl_seat_capability {
    pub type Type = u32;
    pub const WL_SEAT_CAPABILITY_POINTER: Type = 1;
    pub const WL_SEAT_CAPABILITY_KEYBOARD: Type = 2;
    pub const WL_SEAT_CAPABILITY_TOUCH: Type = 4;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_seat_interface {
    pub get_pointer: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource, id: u32),
    >,
    pub get_keyboard: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource, id: u32),
    >,
    pub get_touch: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource, id: u32),
    >,
    pub release: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
}
#[test]
fn bindgen_test_layout_wl_seat_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_seat_interface>(),
        32usize,
        concat!("Size of: ", stringify!(wl_seat_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_seat_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_seat_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_seat_interface>())).get_pointer as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_seat_interface),
            "::",
            stringify!(get_pointer)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_seat_interface>())).get_keyboard as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_seat_interface),
            "::",
            stringify!(get_keyboard)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_seat_interface>())).get_touch as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_seat_interface),
            "::",
            stringify!(get_touch)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_seat_interface>())).release as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_seat_interface),
            "::",
            stringify!(release)
        )
    );
}
pub mod wl_pointer_error {
    pub type Type = u32;
    pub const WL_POINTER_ERROR_ROLE: Type = 0;
}
pub mod wl_pointer_button_state {
    pub type Type = u32;
    pub const WL_POINTER_BUTTON_STATE_RELEASED: Type = 0;
    pub const WL_POINTER_BUTTON_STATE_PRESSED: Type = 1;
}
pub mod wl_pointer_axis {
    pub type Type = u32;
    pub const WL_POINTER_AXIS_VERTICAL_SCROLL: Type = 0;
    pub const WL_POINTER_AXIS_HORIZONTAL_SCROLL: Type = 1;
}
pub mod wl_pointer_axis_source {
    pub type Type = u32;
    pub const WL_POINTER_AXIS_SOURCE_WHEEL: Type = 0;
    pub const WL_POINTER_AXIS_SOURCE_FINGER: Type = 1;
    pub const WL_POINTER_AXIS_SOURCE_CONTINUOUS: Type = 2;
    pub const WL_POINTER_AXIS_SOURCE_WHEEL_TILT: Type = 3;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_pointer_interface {
    pub set_cursor: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            serial: u32,
            surface: *mut wl_resource,
            hotspot_x: i32,
            hotspot_y: i32,
        ),
    >,
    pub release: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
}
#[test]
fn bindgen_test_layout_wl_pointer_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_pointer_interface>(),
        16usize,
        concat!("Size of: ", stringify!(wl_pointer_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_pointer_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_pointer_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_pointer_interface>())).set_cursor as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_pointer_interface),
            "::",
            stringify!(set_cursor)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_pointer_interface>())).release as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_pointer_interface),
            "::",
            stringify!(release)
        )
    );
}
pub mod wl_keyboard_keymap_format {
    pub type Type = u32;
    pub const WL_KEYBOARD_KEYMAP_FORMAT_NO_KEYMAP: Type = 0;
    pub const WL_KEYBOARD_KEYMAP_FORMAT_XKB_V1: Type = 1;
}
pub mod wl_keyboard_key_state {
    pub type Type = u32;
    pub const WL_KEYBOARD_KEY_STATE_RELEASED: Type = 0;
    pub const WL_KEYBOARD_KEY_STATE_PRESSED: Type = 1;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_keyboard_interface {
    pub release: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
}
#[test]
fn bindgen_test_layout_wl_keyboard_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_keyboard_interface>(),
        8usize,
        concat!("Size of: ", stringify!(wl_keyboard_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_keyboard_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_keyboard_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_keyboard_interface>())).release as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_keyboard_interface),
            "::",
            stringify!(release)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_touch_interface {
    pub release: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
}
#[test]
fn bindgen_test_layout_wl_touch_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_touch_interface>(),
        8usize,
        concat!("Size of: ", stringify!(wl_touch_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_touch_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_touch_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_touch_interface>())).release as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_touch_interface),
            "::",
            stringify!(release)
        )
    );
}
pub mod wl_output_subpixel {
    pub type Type = u32;
    pub const WL_OUTPUT_SUBPIXEL_UNKNOWN: Type = 0;
    pub const WL_OUTPUT_SUBPIXEL_NONE: Type = 1;
    pub const WL_OUTPUT_SUBPIXEL_HORIZONTAL_RGB: Type = 2;
    pub const WL_OUTPUT_SUBPIXEL_HORIZONTAL_BGR: Type = 3;
    pub const WL_OUTPUT_SUBPIXEL_VERTICAL_RGB: Type = 4;
    pub const WL_OUTPUT_SUBPIXEL_VERTICAL_BGR: Type = 5;
}
pub mod wl_output_transform {
    pub type Type = u32;
    pub const WL_OUTPUT_TRANSFORM_NORMAL: Type = 0;
    pub const WL_OUTPUT_TRANSFORM_90: Type = 1;
    pub const WL_OUTPUT_TRANSFORM_180: Type = 2;
    pub const WL_OUTPUT_TRANSFORM_270: Type = 3;
    pub const WL_OUTPUT_TRANSFORM_FLIPPED: Type = 4;
    pub const WL_OUTPUT_TRANSFORM_FLIPPED_90: Type = 5;
    pub const WL_OUTPUT_TRANSFORM_FLIPPED_180: Type = 6;
    pub const WL_OUTPUT_TRANSFORM_FLIPPED_270: Type = 7;
}
pub mod wl_output_mode {
    pub type Type = u32;
    pub const WL_OUTPUT_MODE_CURRENT: Type = 1;
    pub const WL_OUTPUT_MODE_PREFERRED: Type = 2;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_output_interface {
    pub release: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
}
#[test]
fn bindgen_test_layout_wl_output_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_output_interface>(),
        8usize,
        concat!("Size of: ", stringify!(wl_output_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_output_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_output_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_output_interface>())).release as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_output_interface),
            "::",
            stringify!(release)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_region_interface {
    pub destroy: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
    pub add: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            x: i32,
            y: i32,
            width: i32,
            height: i32,
        ),
    >,
    pub subtract: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            x: i32,
            y: i32,
            width: i32,
            height: i32,
        ),
    >,
}
#[test]
fn bindgen_test_layout_wl_region_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_region_interface>(),
        24usize,
        concat!("Size of: ", stringify!(wl_region_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_region_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_region_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_region_interface>())).destroy as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_region_interface),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_region_interface>())).add as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_region_interface),
            "::",
            stringify!(add)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_region_interface>())).subtract as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_region_interface),
            "::",
            stringify!(subtract)
        )
    );
}
pub mod wl_subcompositor_error {
    pub type Type = u32;
    pub const WL_SUBCOMPOSITOR_ERROR_BAD_SURFACE: Type = 0;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_subcompositor_interface {
    pub destroy: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
    pub get_subsurface: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            id: u32,
            surface: *mut wl_resource,
            parent: *mut wl_resource,
        ),
    >,
}
#[test]
fn bindgen_test_layout_wl_subcompositor_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_subcompositor_interface>(),
        16usize,
        concat!("Size of: ", stringify!(wl_subcompositor_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_subcompositor_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_subcompositor_interface))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_subcompositor_interface>())).destroy as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_subcompositor_interface),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_subcompositor_interface>())).get_subsurface as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_subcompositor_interface),
            "::",
            stringify!(get_subsurface)
        )
    );
}
pub mod wl_subsurface_error {
    pub type Type = u32;
    pub const WL_SUBSURFACE_ERROR_BAD_SURFACE: Type = 0;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wl_subsurface_interface {
    pub destroy: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
    pub set_position: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource, x: i32, y: i32),
    >,
    pub place_above: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            sibling: *mut wl_resource,
        ),
    >,
    pub place_below: ::std::option::Option<
        unsafe extern "C" fn(
            client: *mut wl_client,
            resource: *mut wl_resource,
            sibling: *mut wl_resource,
        ),
    >,
    pub set_sync: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
    pub set_desync: ::std::option::Option<
        unsafe extern "C" fn(client: *mut wl_client, resource: *mut wl_resource),
    >,
}
#[test]
fn bindgen_test_layout_wl_subsurface_interface() {
    assert_eq!(
        ::std::mem::size_of::<wl_subsurface_interface>(),
        48usize,
        concat!("Size of: ", stringify!(wl_subsurface_interface))
    );
    assert_eq!(
        ::std::mem::align_of::<wl_subsurface_interface>(),
        8usize,
        concat!("Alignment of ", stringify!(wl_subsurface_interface))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wl_subsurface_interface>())).destroy as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_subsurface_interface),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_subsurface_interface>())).set_position as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_subsurface_interface),
            "::",
            stringify!(set_position)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_subsurface_interface>())).place_above as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_subsurface_interface),
            "::",
            stringify!(place_above)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_subsurface_interface>())).place_below as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_subsurface_interface),
            "::",
            stringify!(place_below)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_subsurface_interface>())).set_sync as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_subsurface_interface),
            "::",
            stringify!(set_sync)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wl_subsurface_interface>())).set_desync as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wl_subsurface_interface),
            "::",
            stringify!(set_desync)
        )
    );
}
extern "C" {
    pub fn gnu_dev_major(__dev: __dev_t) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_minor(__dev: __dev_t) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_makedev(
        __major: ::std::os::raw::c_uint,
        __minor: ::std::os::raw::c_uint,
    ) -> __dev_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct udev {
    _unused: [u8; 0],
}
extern "C" {
    pub fn udev_ref(udev: *mut udev) -> *mut udev;
}
extern "C" {
    pub fn udev_unref(udev: *mut udev) -> *mut udev;
}
extern "C" {
    pub fn udev_new() -> *mut udev;
}
extern "C" {
    pub fn udev_set_log_fn(
        udev: *mut udev,
        log_fn: ::std::option::Option<
            unsafe extern "C" fn(
                udev: *mut udev,
                priority: ::std::os::raw::c_int,
                file: *const ::std::os::raw::c_char,
                line: ::std::os::raw::c_int,
                fn_: *const ::std::os::raw::c_char,
                format: *const ::std::os::raw::c_char,
                args: *mut __va_list_tag,
            ),
        >,
    );
}
extern "C" {
    pub fn udev_get_log_priority(udev: *mut udev) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_set_log_priority(udev: *mut udev, priority: ::std::os::raw::c_int);
}
extern "C" {
    pub fn udev_get_userdata(udev: *mut udev) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn udev_set_userdata(udev: *mut udev, userdata: *mut ::std::os::raw::c_void);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct udev_list_entry {
    _unused: [u8; 0],
}
extern "C" {
    pub fn udev_list_entry_get_next(list_entry: *mut udev_list_entry) -> *mut udev_list_entry;
}
extern "C" {
    pub fn udev_list_entry_get_by_name(
        list_entry: *mut udev_list_entry,
        name: *const ::std::os::raw::c_char,
    ) -> *mut udev_list_entry;
}
extern "C" {
    pub fn udev_list_entry_get_name(
        list_entry: *mut udev_list_entry,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn udev_list_entry_get_value(
        list_entry: *mut udev_list_entry,
    ) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct udev_device {
    _unused: [u8; 0],
}
extern "C" {
    pub fn udev_device_ref(udev_device: *mut udev_device) -> *mut udev_device;
}
extern "C" {
    pub fn udev_device_unref(udev_device: *mut udev_device) -> *mut udev_device;
}
extern "C" {
    pub fn udev_device_get_udev(udev_device: *mut udev_device) -> *mut udev;
}
extern "C" {
    pub fn udev_device_new_from_syspath(
        udev: *mut udev,
        syspath: *const ::std::os::raw::c_char,
    ) -> *mut udev_device;
}
extern "C" {
    pub fn udev_device_new_from_devnum(
        udev: *mut udev,
        type_: ::std::os::raw::c_char,
        devnum: dev_t,
    ) -> *mut udev_device;
}
extern "C" {
    pub fn udev_device_new_from_subsystem_sysname(
        udev: *mut udev,
        subsystem: *const ::std::os::raw::c_char,
        sysname: *const ::std::os::raw::c_char,
    ) -> *mut udev_device;
}
extern "C" {
    pub fn udev_device_new_from_device_id(
        udev: *mut udev,
        id: *const ::std::os::raw::c_char,
    ) -> *mut udev_device;
}
extern "C" {
    pub fn udev_device_new_from_environment(udev: *mut udev) -> *mut udev_device;
}
extern "C" {
    pub fn udev_device_get_parent(udev_device: *mut udev_device) -> *mut udev_device;
}
extern "C" {
    pub fn udev_device_get_parent_with_subsystem_devtype(
        udev_device: *mut udev_device,
        subsystem: *const ::std::os::raw::c_char,
        devtype: *const ::std::os::raw::c_char,
    ) -> *mut udev_device;
}
extern "C" {
    pub fn udev_device_get_devpath(udev_device: *mut udev_device) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn udev_device_get_subsystem(
        udev_device: *mut udev_device,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn udev_device_get_devtype(udev_device: *mut udev_device) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn udev_device_get_syspath(udev_device: *mut udev_device) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn udev_device_get_sysname(udev_device: *mut udev_device) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn udev_device_get_sysnum(udev_device: *mut udev_device) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn udev_device_get_devnode(udev_device: *mut udev_device) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn udev_device_get_is_initialized(udev_device: *mut udev_device) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_device_get_devlinks_list_entry(
        udev_device: *mut udev_device,
    ) -> *mut udev_list_entry;
}
extern "C" {
    pub fn udev_device_get_properties_list_entry(
        udev_device: *mut udev_device,
    ) -> *mut udev_list_entry;
}
extern "C" {
    pub fn udev_device_get_tags_list_entry(udev_device: *mut udev_device) -> *mut udev_list_entry;
}
extern "C" {
    pub fn udev_device_get_sysattr_list_entry(
        udev_device: *mut udev_device,
    ) -> *mut udev_list_entry;
}
extern "C" {
    pub fn udev_device_get_property_value(
        udev_device: *mut udev_device,
        key: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn udev_device_get_driver(udev_device: *mut udev_device) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn udev_device_get_devnum(udev_device: *mut udev_device) -> dev_t;
}
extern "C" {
    pub fn udev_device_get_action(udev_device: *mut udev_device) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn udev_device_get_seqnum(udev_device: *mut udev_device) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn udev_device_get_usec_since_initialized(
        udev_device: *mut udev_device,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn udev_device_get_sysattr_value(
        udev_device: *mut udev_device,
        sysattr: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn udev_device_set_sysattr_value(
        udev_device: *mut udev_device,
        sysattr: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_device_has_tag(
        udev_device: *mut udev_device,
        tag: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct udev_monitor {
    _unused: [u8; 0],
}
extern "C" {
    pub fn udev_monitor_ref(udev_monitor: *mut udev_monitor) -> *mut udev_monitor;
}
extern "C" {
    pub fn udev_monitor_unref(udev_monitor: *mut udev_monitor) -> *mut udev_monitor;
}
extern "C" {
    pub fn udev_monitor_get_udev(udev_monitor: *mut udev_monitor) -> *mut udev;
}
extern "C" {
    pub fn udev_monitor_new_from_netlink(
        udev: *mut udev,
        name: *const ::std::os::raw::c_char,
    ) -> *mut udev_monitor;
}
extern "C" {
    pub fn udev_monitor_enable_receiving(udev_monitor: *mut udev_monitor) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_monitor_set_receive_buffer_size(
        udev_monitor: *mut udev_monitor,
        size: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_monitor_get_fd(udev_monitor: *mut udev_monitor) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_monitor_receive_device(udev_monitor: *mut udev_monitor) -> *mut udev_device;
}
extern "C" {
    pub fn udev_monitor_filter_add_match_subsystem_devtype(
        udev_monitor: *mut udev_monitor,
        subsystem: *const ::std::os::raw::c_char,
        devtype: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_monitor_filter_add_match_tag(
        udev_monitor: *mut udev_monitor,
        tag: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_monitor_filter_update(udev_monitor: *mut udev_monitor) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_monitor_filter_remove(udev_monitor: *mut udev_monitor) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct udev_enumerate {
    _unused: [u8; 0],
}
extern "C" {
    pub fn udev_enumerate_ref(udev_enumerate: *mut udev_enumerate) -> *mut udev_enumerate;
}
extern "C" {
    pub fn udev_enumerate_unref(udev_enumerate: *mut udev_enumerate) -> *mut udev_enumerate;
}
extern "C" {
    pub fn udev_enumerate_get_udev(udev_enumerate: *mut udev_enumerate) -> *mut udev;
}
extern "C" {
    pub fn udev_enumerate_new(udev: *mut udev) -> *mut udev_enumerate;
}
extern "C" {
    pub fn udev_enumerate_add_match_subsystem(
        udev_enumerate: *mut udev_enumerate,
        subsystem: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_enumerate_add_nomatch_subsystem(
        udev_enumerate: *mut udev_enumerate,
        subsystem: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_enumerate_add_match_sysattr(
        udev_enumerate: *mut udev_enumerate,
        sysattr: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_enumerate_add_nomatch_sysattr(
        udev_enumerate: *mut udev_enumerate,
        sysattr: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_enumerate_add_match_property(
        udev_enumerate: *mut udev_enumerate,
        property: *const ::std::os::raw::c_char,
        value: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_enumerate_add_match_sysname(
        udev_enumerate: *mut udev_enumerate,
        sysname: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_enumerate_add_match_tag(
        udev_enumerate: *mut udev_enumerate,
        tag: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_enumerate_add_match_parent(
        udev_enumerate: *mut udev_enumerate,
        parent: *mut udev_device,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_enumerate_add_match_is_initialized(
        udev_enumerate: *mut udev_enumerate,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_enumerate_add_syspath(
        udev_enumerate: *mut udev_enumerate,
        syspath: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_enumerate_scan_devices(
        udev_enumerate: *mut udev_enumerate,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_enumerate_scan_subsystems(
        udev_enumerate: *mut udev_enumerate,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_enumerate_get_list_entry(
        udev_enumerate: *mut udev_enumerate,
    ) -> *mut udev_list_entry;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct udev_queue {
    _unused: [u8; 0],
}
extern "C" {
    pub fn udev_queue_ref(udev_queue: *mut udev_queue) -> *mut udev_queue;
}
extern "C" {
    pub fn udev_queue_unref(udev_queue: *mut udev_queue) -> *mut udev_queue;
}
extern "C" {
    pub fn udev_queue_get_udev(udev_queue: *mut udev_queue) -> *mut udev;
}
extern "C" {
    pub fn udev_queue_new(udev: *mut udev) -> *mut udev_queue;
}
extern "C" {
    pub fn udev_queue_get_kernel_seqnum(udev_queue: *mut udev_queue)
        -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn udev_queue_get_udev_seqnum(udev_queue: *mut udev_queue) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn udev_queue_get_udev_is_active(udev_queue: *mut udev_queue) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_queue_get_queue_is_empty(udev_queue: *mut udev_queue) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_queue_get_seqnum_is_finished(
        udev_queue: *mut udev_queue,
        seqnum: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_queue_get_seqnum_sequence_is_finished(
        udev_queue: *mut udev_queue,
        start: ::std::os::raw::c_ulonglong,
        end: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_queue_get_fd(udev_queue: *mut udev_queue) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_queue_flush(udev_queue: *mut udev_queue) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn udev_queue_get_queued_list_entry(udev_queue: *mut udev_queue) -> *mut udev_list_entry;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct udev_hwdb {
    _unused: [u8; 0],
}
extern "C" {
    pub fn udev_hwdb_new(udev: *mut udev) -> *mut udev_hwdb;
}
extern "C" {
    pub fn udev_hwdb_ref(hwdb: *mut udev_hwdb) -> *mut udev_hwdb;
}
extern "C" {
    pub fn udev_hwdb_unref(hwdb: *mut udev_hwdb) -> *mut udev_hwdb;
}
extern "C" {
    pub fn udev_hwdb_get_properties_list_entry(
        hwdb: *mut udev_hwdb,
        modalias: *const ::std::os::raw::c_char,
        flags: ::std::os::raw::c_uint,
    ) -> *mut udev_list_entry;
}
extern "C" {
    pub fn udev_util_encode_string(
        str: *const ::std::os::raw::c_char,
        str_enc: *mut ::std::os::raw::c_char,
        len: usize,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct session_impl {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wlr_device {
    pub fd: ::std::os::raw::c_int,
    pub dev: dev_t,
    pub signal: wl_signal,
    pub link: wl_list,
}
#[test]
fn bindgen_test_layout_wlr_device() {
    assert_eq!(
        ::std::mem::size_of::<wlr_device>(),
        48usize,
        concat!("Size of: ", stringify!(wlr_device))
    );
    assert_eq!(
        ::std::mem::align_of::<wlr_device>(),
        8usize,
        concat!("Alignment of ", stringify!(wlr_device))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_device>())).fd as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_device),
            "::",
            stringify!(fd)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_device>())).dev as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_device),
            "::",
            stringify!(dev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_device>())).signal as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_device),
            "::",
            stringify!(signal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_device>())).link as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_device),
            "::",
            stringify!(link)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct wlr_session {
    pub impl_: *const session_impl,
    pub session_signal: wl_signal,
    pub active: bool,
    pub vtnr: ::std::os::raw::c_uint,
    pub seat: [::std::os::raw::c_char; 256usize],
    pub udev: *mut udev,
    pub mon: *mut udev_monitor,
    pub udev_event: *mut wl_event_source,
    pub devices: wl_list,
    pub display_destroy: wl_listener,
    pub events: wlr_session__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wlr_session__bindgen_ty_1 {
    pub destroy: wl_signal,
}
#[test]
fn bindgen_test_layout_wlr_session__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<wlr_session__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(wlr_session__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<wlr_session__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(wlr_session__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wlr_session__bindgen_ty_1>())).destroy as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_session__bindgen_ty_1),
            "::",
            stringify!(destroy)
        )
    );
}
#[test]
fn bindgen_test_layout_wlr_session() {
    assert_eq!(
        ::std::mem::size_of::<wlr_session>(),
        368usize,
        concat!("Size of: ", stringify!(wlr_session))
    );
    assert_eq!(
        ::std::mem::align_of::<wlr_session>(),
        8usize,
        concat!("Alignment of ", stringify!(wlr_session))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_session>())).impl_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_session),
            "::",
            stringify!(impl_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_session>())).session_signal as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_session),
            "::",
            stringify!(session_signal)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_session>())).active as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_session),
            "::",
            stringify!(active)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_session>())).vtnr as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_session),
            "::",
            stringify!(vtnr)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_session>())).seat as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_session),
            "::",
            stringify!(seat)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_session>())).udev as *const _ as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_session),
            "::",
            stringify!(udev)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_session>())).mon as *const _ as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_session),
            "::",
            stringify!(mon)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_session>())).udev_event as *const _ as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_session),
            "::",
            stringify!(udev_event)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_session>())).devices as *const _ as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_session),
            "::",
            stringify!(devices)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_session>())).display_destroy as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_session),
            "::",
            stringify!(display_destroy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_session>())).events as *const _ as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_session),
            "::",
            stringify!(events)
        )
    );
}
extern "C" {
    pub fn wlr_session_create(disp: *mut wl_display) -> *mut wlr_session;
}
extern "C" {
    pub fn wlr_session_destroy(session: *mut wlr_session);
}
extern "C" {
    pub fn wlr_session_open_file(
        session: *mut wlr_session,
        path: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wlr_session_close_file(session: *mut wlr_session, fd: ::std::os::raw::c_int);
}
extern "C" {
    pub fn wlr_session_signal_add(
        session: *mut wlr_session,
        fd: ::std::os::raw::c_int,
        listener: *mut wl_listener,
    );
}
extern "C" {
    pub fn wlr_session_change_vt(session: *mut wlr_session, vt: ::std::os::raw::c_uint) -> bool;
}
extern "C" {
    pub fn wlr_session_find_gpus(
        session: *mut wlr_session,
        ret_len: usize,
        ret: *mut ::std::os::raw::c_int,
    ) -> usize;
}
pub type khronos_int32_t = i32;
pub type khronos_uint32_t = u32;
pub type khronos_int64_t = i64;
pub type khronos_uint64_t = u64;
pub type khronos_int8_t = ::std::os::raw::c_schar;
pub type khronos_uint8_t = ::std::os::raw::c_uchar;
pub type khronos_int16_t = ::std::os::raw::c_short;
pub type khronos_uint16_t = ::std::os::raw::c_ushort;
pub type khronos_intptr_t = ::std::os::raw::c_long;
pub type khronos_uintptr_t = ::std::os::raw::c_ulong;
pub type khronos_ssize_t = ::std::os::raw::c_long;
pub type khronos_usize_t = ::std::os::raw::c_ulong;
pub type khronos_float_t = f32;
pub type khronos_utime_nanoseconds_t = khronos_uint64_t;
pub type khronos_stime_nanoseconds_t = khronos_int64_t;
pub mod khronos_boolean_enum_t {
    pub type Type = u32;
    pub const KHRONOS_FALSE: Type = 0;
    pub const KHRONOS_TRUE: Type = 1;
    pub const KHRONOS_BOOLEAN_ENUM_FORCE_SIZE: Type = 2147483647;
}
pub type EGLNativeDisplayType = *mut ::std::os::raw::c_void;
pub type EGLNativePixmapType = khronos_uintptr_t;
pub type EGLNativeWindowType = khronos_uintptr_t;
pub type NativeDisplayType = EGLNativeDisplayType;
pub type NativePixmapType = EGLNativePixmapType;
pub type NativeWindowType = EGLNativeWindowType;
pub type EGLint = khronos_int32_t;
pub type EGLBoolean = ::std::os::raw::c_uint;
pub type EGLDisplay = *mut ::std::os::raw::c_void;
pub type EGLConfig = *mut ::std::os::raw::c_void;
pub type EGLSurface = *mut ::std::os::raw::c_void;
pub type EGLContext = *mut ::std::os::raw::c_void;
pub type __eglMustCastToProperFunctionPointerType = ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    pub fn eglChooseConfig(
        dpy: EGLDisplay,
        attrib_list: *const EGLint,
        configs: *mut EGLConfig,
        config_size: EGLint,
        num_config: *mut EGLint,
    ) -> EGLBoolean;
}
extern "C" {
    pub fn eglCopyBuffers(
        dpy: EGLDisplay,
        surface: EGLSurface,
        target: EGLNativePixmapType,
    ) -> EGLBoolean;
}
extern "C" {
    pub fn eglCreateContext(
        dpy: EGLDisplay,
        config: EGLConfig,
        share_context: EGLContext,
        attrib_list: *const EGLint,
    ) -> EGLContext;
}
extern "C" {
    pub fn eglCreatePbufferSurface(
        dpy: EGLDisplay,
        config: EGLConfig,
        attrib_list: *const EGLint,
    ) -> EGLSurface;
}
extern "C" {
    pub fn eglCreatePixmapSurface(
        dpy: EGLDisplay,
        config: EGLConfig,
        pixmap: EGLNativePixmapType,
        attrib_list: *const EGLint,
    ) -> EGLSurface;
}
extern "C" {
    pub fn eglCreateWindowSurface(
        dpy: EGLDisplay,
        config: EGLConfig,
        win: EGLNativeWindowType,
        attrib_list: *const EGLint,
    ) -> EGLSurface;
}
extern "C" {
    pub fn eglDestroyContext(dpy: EGLDisplay, ctx: EGLContext) -> EGLBoolean;
}
extern "C" {
    pub fn eglDestroySurface(dpy: EGLDisplay, surface: EGLSurface) -> EGLBoolean;
}
extern "C" {
    pub fn eglGetConfigAttrib(
        dpy: EGLDisplay,
        config: EGLConfig,
        attribute: EGLint,
        value: *mut EGLint,
    ) -> EGLBoolean;
}
extern "C" {
    pub fn eglGetConfigs(
        dpy: EGLDisplay,
        configs: *mut EGLConfig,
        config_size: EGLint,
        num_config: *mut EGLint,
    ) -> EGLBoolean;
}
extern "C" {
    pub fn eglGetCurrentDisplay() -> EGLDisplay;
}
extern "C" {
    pub fn eglGetCurrentSurface(readdraw: EGLint) -> EGLSurface;
}
extern "C" {
    pub fn eglGetDisplay(display_id: EGLNativeDisplayType) -> EGLDisplay;
}
extern "C" {
    pub fn eglGetError() -> EGLint;
}
extern "C" {
    pub fn eglGetProcAddress(
        procname: *const ::std::os::raw::c_char,
    ) -> __eglMustCastToProperFunctionPointerType;
}
extern "C" {
    pub fn eglInitialize(dpy: EGLDisplay, major: *mut EGLint, minor: *mut EGLint) -> EGLBoolean;
}
extern "C" {
    pub fn eglMakeCurrent(
        dpy: EGLDisplay,
        draw: EGLSurface,
        read: EGLSurface,
        ctx: EGLContext,
    ) -> EGLBoolean;
}
extern "C" {
    pub fn eglQueryContext(
        dpy: EGLDisplay,
        ctx: EGLContext,
        attribute: EGLint,
        value: *mut EGLint,
    ) -> EGLBoolean;
}
extern "C" {
    pub fn eglQueryString(dpy: EGLDisplay, name: EGLint) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn eglQuerySurface(
        dpy: EGLDisplay,
        surface: EGLSurface,
        attribute: EGLint,
        value: *mut EGLint,
    ) -> EGLBoolean;
}
extern "C" {
    pub fn eglSwapBuffers(dpy: EGLDisplay, surface: EGLSurface) -> EGLBoolean;
}
extern "C" {
    pub fn eglTerminate(dpy: EGLDisplay) -> EGLBoolean;
}
extern "C" {
    pub fn eglWaitGL() -> EGLBoolean;
}
extern "C" {
    pub fn eglWaitNative(engine: EGLint) -> EGLBoolean;
}
extern "C" {
    pub fn eglBindTexImage(dpy: EGLDisplay, surface: EGLSurface, buffer: EGLint) -> EGLBoolean;
}
extern "C" {
    pub fn eglReleaseTexImage(dpy: EGLDisplay, surface: EGLSurface, buffer: EGLint) -> EGLBoolean;
}
extern "C" {
    pub fn eglSurfaceAttrib(
        dpy: EGLDisplay,
        surface: EGLSurface,
        attribute: EGLint,
        value: EGLint,
    ) -> EGLBoolean;
}
extern "C" {
    pub fn eglSwapInterval(dpy: EGLDisplay, interval: EGLint) -> EGLBoolean;
}
pub type EGLenum = ::std::os::raw::c_uint;
pub type EGLClientBuffer = *mut ::std::os::raw::c_void;
extern "C" {
    pub fn eglBindAPI(api: EGLenum) -> EGLBoolean;
}
extern "C" {
    pub fn eglQueryAPI() -> EGLenum;
}
extern "C" {
    pub fn eglCreatePbufferFromClientBuffer(
        dpy: EGLDisplay,
        buftype: EGLenum,
        buffer: EGLClientBuffer,
        config: EGLConfig,
        attrib_list: *const EGLint,
    ) -> EGLSurface;
}
extern "C" {
    pub fn eglReleaseThread() -> EGLBoolean;
}
extern "C" {
    pub fn eglWaitClient() -> EGLBoolean;
}
extern "C" {
    pub fn eglGetCurrentContext() -> EGLContext;
}
pub type EGLSync = *mut ::std::os::raw::c_void;
pub type EGLAttrib = isize;
pub type EGLTime = khronos_utime_nanoseconds_t;
pub type EGLImage = *mut ::std::os::raw::c_void;
extern "C" {
    pub fn eglCreateSync(dpy: EGLDisplay, type_: EGLenum, attrib_list: *const EGLAttrib)
        -> EGLSync;
}
extern "C" {
    pub fn eglDestroySync(dpy: EGLDisplay, sync: EGLSync) -> EGLBoolean;
}
extern "C" {
    pub fn eglClientWaitSync(
        dpy: EGLDisplay,
        sync: EGLSync,
        flags: EGLint,
        timeout: EGLTime,
    ) -> EGLint;
}
extern "C" {
    pub fn eglGetSyncAttrib(
        dpy: EGLDisplay,
        sync: EGLSync,
        attribute: EGLint,
        value: *mut EGLAttrib,
    ) -> EGLBoolean;
}
extern "C" {
    pub fn eglCreateImage(
        dpy: EGLDisplay,
        ctx: EGLContext,
        target: EGLenum,
        buffer: EGLClientBuffer,
        attrib_list: *const EGLAttrib,
    ) -> EGLImage;
}
extern "C" {
    pub fn eglDestroyImage(dpy: EGLDisplay, image: EGLImage) -> EGLBoolean;
}
extern "C" {
    pub fn eglGetPlatformDisplay(
        platform: EGLenum,
        native_display: *mut ::std::os::raw::c_void,
        attrib_list: *const EGLAttrib,
    ) -> EGLDisplay;
}
extern "C" {
    pub fn eglCreatePlatformWindowSurface(
        dpy: EGLDisplay,
        config: EGLConfig,
        native_window: *mut ::std::os::raw::c_void,
        attrib_list: *const EGLAttrib,
    ) -> EGLSurface;
}
extern "C" {
    pub fn eglCreatePlatformPixmapSurface(
        dpy: EGLDisplay,
        config: EGLConfig,
        native_pixmap: *mut ::std::os::raw::c_void,
        attrib_list: *const EGLAttrib,
    ) -> EGLSurface;
}
extern "C" {
    pub fn eglWaitSync(dpy: EGLDisplay, sync: EGLSync, flags: EGLint) -> EGLBoolean;
}
pub type EGLSyncKHR = *mut ::std::os::raw::c_void;
pub type EGLAttribKHR = isize;
pub type PFNEGLCREATESYNC64KHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        type_: EGLenum,
        attrib_list: *const EGLAttribKHR,
    ) -> EGLSyncKHR,
>;
pub type EGLLabelKHR = *mut ::std::os::raw::c_void;
pub type EGLObjectKHR = *mut ::std::os::raw::c_void;
pub type EGLDEBUGPROCKHR = ::std::option::Option<
    unsafe extern "C" fn(
        error: EGLenum,
        command: *const ::std::os::raw::c_char,
        messageType: EGLint,
        threadLabel: EGLLabelKHR,
        objectLabel: EGLLabelKHR,
        message: *const ::std::os::raw::c_char,
    ),
>;
pub type PFNEGLDEBUGMESSAGECONTROLKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(callback: EGLDEBUGPROCKHR, attrib_list: *const EGLAttrib) -> EGLint,
>;
pub type PFNEGLQUERYDEBUGKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(attribute: EGLint, value: *mut EGLAttrib) -> EGLBoolean,
>;
pub type PFNEGLLABELOBJECTKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        display: EGLDisplay,
        objectType: EGLenum,
        object: EGLObjectKHR,
        label: EGLLabelKHR,
    ) -> EGLint,
>;
pub type PFNEGLQUERYDISPLAYATTRIBKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, name: EGLint, value: *mut EGLAttrib) -> EGLBoolean,
>;
pub type EGLTimeKHR = khronos_utime_nanoseconds_t;
pub type PFNEGLCREATESYNCKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, type_: EGLenum, attrib_list: *const EGLint) -> EGLSyncKHR,
>;
pub type PFNEGLDESTROYSYNCKHRPROC =
    ::std::option::Option<unsafe extern "C" fn(dpy: EGLDisplay, sync: EGLSyncKHR) -> EGLBoolean>;
pub type PFNEGLCLIENTWAITSYNCKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        sync: EGLSyncKHR,
        flags: EGLint,
        timeout: EGLTimeKHR,
    ) -> EGLint,
>;
pub type PFNEGLGETSYNCATTRIBKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        sync: EGLSyncKHR,
        attribute: EGLint,
        value: *mut EGLint,
    ) -> EGLBoolean,
>;
pub type EGLImageKHR = *mut ::std::os::raw::c_void;
pub type PFNEGLCREATEIMAGEKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        ctx: EGLContext,
        target: EGLenum,
        buffer: EGLClientBuffer,
        attrib_list: *const EGLint,
    ) -> EGLImageKHR,
>;
pub type PFNEGLDESTROYIMAGEKHRPROC =
    ::std::option::Option<unsafe extern "C" fn(dpy: EGLDisplay, image: EGLImageKHR) -> EGLBoolean>;
pub type PFNEGLLOCKSURFACEKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surface: EGLSurface,
        attrib_list: *const EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLUNLOCKSURFACEKHRPROC =
    ::std::option::Option<unsafe extern "C" fn(dpy: EGLDisplay, surface: EGLSurface) -> EGLBoolean>;
pub type PFNEGLQUERYSURFACE64KHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surface: EGLSurface,
        attribute: EGLint,
        value: *mut EGLAttribKHR,
    ) -> EGLBoolean,
>;
pub type PFNEGLSETDAMAGEREGIONKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surface: EGLSurface,
        rects: *mut EGLint,
        n_rects: EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLSIGNALSYNCKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, sync: EGLSyncKHR, mode: EGLenum) -> EGLBoolean,
>;
pub type EGLStreamKHR = *mut ::std::os::raw::c_void;
pub type EGLuint64KHR = khronos_uint64_t;
pub type PFNEGLCREATESTREAMKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, attrib_list: *const EGLint) -> EGLStreamKHR,
>;
pub type PFNEGLDESTROYSTREAMKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, stream: EGLStreamKHR) -> EGLBoolean,
>;
pub type PFNEGLSTREAMATTRIBKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        stream: EGLStreamKHR,
        attribute: EGLenum,
        value: EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLQUERYSTREAMKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        stream: EGLStreamKHR,
        attribute: EGLenum,
        value: *mut EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLQUERYSTREAMU64KHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        stream: EGLStreamKHR,
        attribute: EGLenum,
        value: *mut EGLuint64KHR,
    ) -> EGLBoolean,
>;
pub type PFNEGLCREATESTREAMATTRIBKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, attrib_list: *const EGLAttrib) -> EGLStreamKHR,
>;
pub type PFNEGLSETSTREAMATTRIBKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        stream: EGLStreamKHR,
        attribute: EGLenum,
        value: EGLAttrib,
    ) -> EGLBoolean,
>;
pub type PFNEGLQUERYSTREAMATTRIBKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        stream: EGLStreamKHR,
        attribute: EGLenum,
        value: *mut EGLAttrib,
    ) -> EGLBoolean,
>;
pub type PFNEGLSTREAMCONSUMERACQUIREATTRIBKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        stream: EGLStreamKHR,
        attrib_list: *const EGLAttrib,
    ) -> EGLBoolean,
>;
pub type PFNEGLSTREAMCONSUMERRELEASEATTRIBKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        stream: EGLStreamKHR,
        attrib_list: *const EGLAttrib,
    ) -> EGLBoolean,
>;
pub type PFNEGLSTREAMCONSUMERGLTEXTUREEXTERNALKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, stream: EGLStreamKHR) -> EGLBoolean,
>;
pub type PFNEGLSTREAMCONSUMERACQUIREKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, stream: EGLStreamKHR) -> EGLBoolean,
>;
pub type PFNEGLSTREAMCONSUMERRELEASEKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, stream: EGLStreamKHR) -> EGLBoolean,
>;
pub type EGLNativeFileDescriptorKHR = ::std::os::raw::c_int;
pub type PFNEGLGETSTREAMFILEDESCRIPTORKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, stream: EGLStreamKHR) -> EGLNativeFileDescriptorKHR,
>;
pub type PFNEGLCREATESTREAMFROMFILEDESCRIPTORKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        file_descriptor: EGLNativeFileDescriptorKHR,
    ) -> EGLStreamKHR,
>;
pub type PFNEGLQUERYSTREAMTIMEKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        stream: EGLStreamKHR,
        attribute: EGLenum,
        value: *mut EGLTimeKHR,
    ) -> EGLBoolean,
>;
pub type PFNEGLCREATESTREAMPRODUCERSURFACEKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        config: EGLConfig,
        stream: EGLStreamKHR,
        attrib_list: *const EGLint,
    ) -> EGLSurface,
>;
pub type PFNEGLSWAPBUFFERSWITHDAMAGEKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surface: EGLSurface,
        rects: *mut EGLint,
        n_rects: EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLWAITSYNCKHRPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, sync: EGLSyncKHR, flags: EGLint) -> EGLint,
>;
pub type EGLsizeiANDROID = khronos_ssize_t;
pub type EGLSetBlobFuncANDROID = ::std::option::Option<
    unsafe extern "C" fn(
        key: *const ::std::os::raw::c_void,
        keySize: EGLsizeiANDROID,
        value: *const ::std::os::raw::c_void,
        valueSize: EGLsizeiANDROID,
    ),
>;
pub type EGLGetBlobFuncANDROID = ::std::option::Option<
    unsafe extern "C" fn(
        key: *const ::std::os::raw::c_void,
        keySize: EGLsizeiANDROID,
        value: *mut ::std::os::raw::c_void,
        valueSize: EGLsizeiANDROID,
    ) -> EGLsizeiANDROID,
>;
pub type PFNEGLSETBLOBCACHEFUNCSANDROIDPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, set: EGLSetBlobFuncANDROID, get: EGLGetBlobFuncANDROID),
>;
pub type PFNEGLCREATENATIVECLIENTBUFFERANDROIDPROC =
    ::std::option::Option<unsafe extern "C" fn(attrib_list: *const EGLint) -> EGLClientBuffer>;
pub type EGLnsecsANDROID = khronos_stime_nanoseconds_t;
pub type PFNEGLGETCOMPOSITORTIMINGSUPPORTEDANDROIDPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, surface: EGLSurface, name: EGLint) -> EGLBoolean,
>;
pub type PFNEGLGETCOMPOSITORTIMINGANDROIDPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surface: EGLSurface,
        numTimestamps: EGLint,
        names: *const EGLint,
        values: *mut EGLnsecsANDROID,
    ) -> EGLBoolean,
>;
pub type PFNEGLGETNEXTFRAMEIDANDROIDPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surface: EGLSurface,
        frameId: *mut EGLuint64KHR,
    ) -> EGLBoolean,
>;
pub type PFNEGLGETFRAMETIMESTAMPSUPPORTEDANDROIDPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, surface: EGLSurface, timestamp: EGLint) -> EGLBoolean,
>;
pub type PFNEGLGETFRAMETIMESTAMPSANDROIDPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surface: EGLSurface,
        frameId: EGLuint64KHR,
        numTimestamps: EGLint,
        timestamps: *const EGLint,
        values: *mut EGLnsecsANDROID,
    ) -> EGLBoolean,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct AHardwareBuffer {
    _unused: [u8; 0],
}
pub type PFNEGLGETNATIVECLIENTBUFFERANDROIDPROC =
    ::std::option::Option<unsafe extern "C" fn(buffer: *const AHardwareBuffer) -> EGLClientBuffer>;
pub type PFNEGLDUPNATIVEFENCEFDANDROIDPROC =
    ::std::option::Option<unsafe extern "C" fn(dpy: EGLDisplay, sync: EGLSyncKHR) -> EGLint>;
pub type PFNEGLPRESENTATIONTIMEANDROIDPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, surface: EGLSurface, time: EGLnsecsANDROID) -> EGLBoolean,
>;
pub type PFNEGLQUERYSURFACEPOINTERANGLEPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surface: EGLSurface,
        attribute: EGLint,
        value: *mut *mut ::std::os::raw::c_void,
    ) -> EGLBoolean,
>;
pub type PFNEGLCLIENTSIGNALSYNCEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        sync: EGLSync,
        attrib_list: *const EGLAttrib,
    ) -> EGLBoolean,
>;
pub type PFNEGLCOMPOSITORSETCONTEXTLISTEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(external_ref_ids: *const EGLint, num_entries: EGLint) -> EGLBoolean,
>;
pub type PFNEGLCOMPOSITORSETCONTEXTATTRIBUTESEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        external_ref_id: EGLint,
        context_attributes: *const EGLint,
        num_entries: EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLCOMPOSITORSETWINDOWLISTEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        external_ref_id: EGLint,
        external_win_ids: *const EGLint,
        num_entries: EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLCOMPOSITORSETWINDOWATTRIBUTESEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        external_win_id: EGLint,
        window_attributes: *const EGLint,
        num_entries: EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLCOMPOSITORBINDTEXWINDOWEXTPROC =
    ::std::option::Option<unsafe extern "C" fn(external_win_id: EGLint) -> EGLBoolean>;
pub type PFNEGLCOMPOSITORSETSIZEEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(external_win_id: EGLint, width: EGLint, height: EGLint) -> EGLBoolean,
>;
pub type PFNEGLCOMPOSITORSWAPPOLICYEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(external_win_id: EGLint, policy: EGLint) -> EGLBoolean,
>;
pub type EGLDeviceEXT = *mut ::std::os::raw::c_void;
pub type PFNEGLQUERYDEVICEATTRIBEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        device: EGLDeviceEXT,
        attribute: EGLint,
        value: *mut EGLAttrib,
    ) -> EGLBoolean,
>;
pub type PFNEGLQUERYDEVICESTRINGEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(device: EGLDeviceEXT, name: EGLint) -> *const ::std::os::raw::c_char,
>;
pub type PFNEGLQUERYDEVICESEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        max_devices: EGLint,
        devices: *mut EGLDeviceEXT,
        num_devices: *mut EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLQUERYDISPLAYATTRIBEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, attribute: EGLint, value: *mut EGLAttrib) -> EGLBoolean,
>;
pub type PFNEGLQUERYDMABUFFORMATSEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        max_formats: EGLint,
        formats: *mut EGLint,
        num_formats: *mut EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLQUERYDMABUFMODIFIERSEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        format: EGLint,
        max_modifiers: EGLint,
        modifiers: *mut EGLuint64KHR,
        external_only: *mut EGLBoolean,
        num_modifiers: *mut EGLint,
    ) -> EGLBoolean,
>;
pub type EGLOutputLayerEXT = *mut ::std::os::raw::c_void;
pub type EGLOutputPortEXT = *mut ::std::os::raw::c_void;
pub type PFNEGLGETOUTPUTLAYERSEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        attrib_list: *const EGLAttrib,
        layers: *mut EGLOutputLayerEXT,
        max_layers: EGLint,
        num_layers: *mut EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLGETOUTPUTPORTSEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        attrib_list: *const EGLAttrib,
        ports: *mut EGLOutputPortEXT,
        max_ports: EGLint,
        num_ports: *mut EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLOUTPUTLAYERATTRIBEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        layer: EGLOutputLayerEXT,
        attribute: EGLint,
        value: EGLAttrib,
    ) -> EGLBoolean,
>;
pub type PFNEGLQUERYOUTPUTLAYERATTRIBEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        layer: EGLOutputLayerEXT,
        attribute: EGLint,
        value: *mut EGLAttrib,
    ) -> EGLBoolean,
>;
pub type PFNEGLQUERYOUTPUTLAYERSTRINGEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        layer: EGLOutputLayerEXT,
        name: EGLint,
    ) -> *const ::std::os::raw::c_char,
>;
pub type PFNEGLOUTPUTPORTATTRIBEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        port: EGLOutputPortEXT,
        attribute: EGLint,
        value: EGLAttrib,
    ) -> EGLBoolean,
>;
pub type PFNEGLQUERYOUTPUTPORTATTRIBEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        port: EGLOutputPortEXT,
        attribute: EGLint,
        value: *mut EGLAttrib,
    ) -> EGLBoolean,
>;
pub type PFNEGLQUERYOUTPUTPORTSTRINGEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        port: EGLOutputPortEXT,
        name: EGLint,
    ) -> *const ::std::os::raw::c_char,
>;
pub type PFNEGLGETPLATFORMDISPLAYEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        platform: EGLenum,
        native_display: *mut ::std::os::raw::c_void,
        attrib_list: *const EGLint,
    ) -> EGLDisplay,
>;
pub type PFNEGLCREATEPLATFORMWINDOWSURFACEEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        config: EGLConfig,
        native_window: *mut ::std::os::raw::c_void,
        attrib_list: *const EGLint,
    ) -> EGLSurface,
>;
pub type PFNEGLCREATEPLATFORMPIXMAPSURFACEEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        config: EGLConfig,
        native_pixmap: *mut ::std::os::raw::c_void,
        attrib_list: *const EGLint,
    ) -> EGLSurface,
>;
pub type PFNEGLSTREAMCONSUMEROUTPUTEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        stream: EGLStreamKHR,
        layer: EGLOutputLayerEXT,
    ) -> EGLBoolean,
>;
pub type PFNEGLSWAPBUFFERSWITHDAMAGEEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surface: EGLSurface,
        rects: *mut EGLint,
        n_rects: EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLUNSIGNALSYNCEXTPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        sync: EGLSync,
        attrib_list: *const EGLAttrib,
    ) -> EGLBoolean,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EGLClientPixmapHI {
    pub pData: *mut ::std::os::raw::c_void,
    pub iWidth: EGLint,
    pub iHeight: EGLint,
    pub iStride: EGLint,
}
#[test]
fn bindgen_test_layout_EGLClientPixmapHI() {
    assert_eq!(
        ::std::mem::size_of::<EGLClientPixmapHI>(),
        24usize,
        concat!("Size of: ", stringify!(EGLClientPixmapHI))
    );
    assert_eq!(
        ::std::mem::align_of::<EGLClientPixmapHI>(),
        8usize,
        concat!("Alignment of ", stringify!(EGLClientPixmapHI))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EGLClientPixmapHI>())).pData as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(EGLClientPixmapHI),
            "::",
            stringify!(pData)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EGLClientPixmapHI>())).iWidth as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(EGLClientPixmapHI),
            "::",
            stringify!(iWidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EGLClientPixmapHI>())).iHeight as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(EGLClientPixmapHI),
            "::",
            stringify!(iHeight)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<EGLClientPixmapHI>())).iStride as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(EGLClientPixmapHI),
            "::",
            stringify!(iStride)
        )
    );
}
pub type PFNEGLCREATEPIXMAPSURFACEHIPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        config: EGLConfig,
        pixmap: *mut EGLClientPixmapHI,
    ) -> EGLSurface,
>;
pub type PFNEGLCREATEDRMIMAGEMESAPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, attrib_list: *const EGLint) -> EGLImageKHR,
>;
pub type PFNEGLEXPORTDRMIMAGEMESAPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        image: EGLImageKHR,
        name: *mut EGLint,
        handle: *mut EGLint,
        stride: *mut EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLEXPORTDMABUFIMAGEQUERYMESAPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        image: EGLImageKHR,
        fourcc: *mut ::std::os::raw::c_int,
        num_planes: *mut ::std::os::raw::c_int,
        modifiers: *mut EGLuint64KHR,
    ) -> EGLBoolean,
>;
pub type PFNEGLEXPORTDMABUFIMAGEMESAPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        image: EGLImageKHR,
        fds: *mut ::std::os::raw::c_int,
        strides: *mut EGLint,
        offsets: *mut EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLGETDISPLAYDRIVERCONFIGPROC =
    ::std::option::Option<unsafe extern "C" fn(dpy: EGLDisplay) -> *mut ::std::os::raw::c_char>;
pub type PFNEGLGETDISPLAYDRIVERNAMEPROC =
    ::std::option::Option<unsafe extern "C" fn(dpy: EGLDisplay) -> *const ::std::os::raw::c_char>;
pub type PFNEGLSWAPBUFFERSREGIONNOKPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surface: EGLSurface,
        numRects: EGLint,
        rects: *const EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLSWAPBUFFERSREGION2NOKPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surface: EGLSurface,
        numRects: EGLint,
        rects: *const EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLQUERYNATIVEDISPLAYNVPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, display_id: *mut EGLNativeDisplayType) -> EGLBoolean,
>;
pub type PFNEGLQUERYNATIVEWINDOWNVPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surf: EGLSurface,
        window: *mut EGLNativeWindowType,
    ) -> EGLBoolean,
>;
pub type PFNEGLQUERYNATIVEPIXMAPNVPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surf: EGLSurface,
        pixmap: *mut EGLNativePixmapType,
    ) -> EGLBoolean,
>;
pub type PFNEGLPOSTSUBBUFFERNVPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surface: EGLSurface,
        x: EGLint,
        y: EGLint,
        width: EGLint,
        height: EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLSTREAMCONSUMERGLTEXTUREEXTERNALATTRIBSNVPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        stream: EGLStreamKHR,
        attrib_list: *const EGLAttrib,
    ) -> EGLBoolean,
>;
pub type PFNEGLSTREAMFLUSHNVPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, stream: EGLStreamKHR) -> EGLBoolean,
>;
pub type PFNEGLQUERYDISPLAYATTRIBNVPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, attribute: EGLint, value: *mut EGLAttrib) -> EGLBoolean,
>;
pub type PFNEGLSETSTREAMMETADATANVPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        stream: EGLStreamKHR,
        n: EGLint,
        offset: EGLint,
        size: EGLint,
        data: *const ::std::os::raw::c_void,
    ) -> EGLBoolean,
>;
pub type PFNEGLQUERYSTREAMMETADATANVPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        stream: EGLStreamKHR,
        name: EGLenum,
        n: EGLint,
        offset: EGLint,
        size: EGLint,
        data: *mut ::std::os::raw::c_void,
    ) -> EGLBoolean,
>;
pub type PFNEGLRESETSTREAMNVPROC = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, stream: EGLStreamKHR) -> EGLBoolean,
>;
pub type PFNEGLCREATESTREAMSYNCNVPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        stream: EGLStreamKHR,
        type_: EGLenum,
        attrib_list: *const EGLint,
    ) -> EGLSyncKHR,
>;
pub type EGLSyncNV = *mut ::std::os::raw::c_void;
pub type EGLTimeNV = khronos_utime_nanoseconds_t;
pub type PFNEGLCREATEFENCESYNCNVPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        condition: EGLenum,
        attrib_list: *const EGLint,
    ) -> EGLSyncNV,
>;
pub type PFNEGLDESTROYSYNCNVPROC =
    ::std::option::Option<unsafe extern "C" fn(sync: EGLSyncNV) -> EGLBoolean>;
pub type PFNEGLFENCENVPROC =
    ::std::option::Option<unsafe extern "C" fn(sync: EGLSyncNV) -> EGLBoolean>;
pub type PFNEGLCLIENTWAITSYNCNVPROC = ::std::option::Option<
    unsafe extern "C" fn(sync: EGLSyncNV, flags: EGLint, timeout: EGLTimeNV) -> EGLint,
>;
pub type PFNEGLSIGNALSYNCNVPROC =
    ::std::option::Option<unsafe extern "C" fn(sync: EGLSyncNV, mode: EGLenum) -> EGLBoolean>;
pub type PFNEGLGETSYNCATTRIBNVPROC = ::std::option::Option<
    unsafe extern "C" fn(sync: EGLSyncNV, attribute: EGLint, value: *mut EGLint) -> EGLBoolean,
>;
pub type EGLuint64NV = khronos_utime_nanoseconds_t;
pub type PFNEGLGETSYSTEMTIMEFREQUENCYNVPROC =
    ::std::option::Option<unsafe extern "C" fn() -> EGLuint64NV>;
pub type PFNEGLGETSYSTEMTIMENVPROC = ::std::option::Option<unsafe extern "C" fn() -> EGLuint64NV>;
pub type PFNEGLBINDWAYLANDDISPLAYWL = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, display: *mut wl_display) -> EGLBoolean,
>;
pub type PFNEGLUNBINDWAYLANDDISPLAYWL = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, display: *mut wl_display) -> EGLBoolean,
>;
pub type PFNEGLQUERYWAYLANDBUFFERWL = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        buffer: *mut wl_resource,
        attribute: EGLint,
        value: *mut EGLint,
    ) -> EGLBoolean,
>;
pub type PFNEGLCREATEWAYLANDBUFFERFROMIMAGEWL = ::std::option::Option<
    unsafe extern "C" fn(dpy: EGLDisplay, image: EGLImageKHR) -> *mut wl_buffer,
>;
pub type PFNEGLSWAPBUFFERSREGIONNOK = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surface: EGLSurface,
        numRects: EGLint,
        rects: *const EGLint,
    ) -> EGLBoolean,
>;
pub type EGLuint64CHROMIUM = khronos_uint64_t;
pub type PFNEGLGETSYNCVALUESCHROMIUMPROC = ::std::option::Option<
    unsafe extern "C" fn(
        dpy: EGLDisplay,
        surface: EGLSurface,
        ust: *mut EGLuint64CHROMIUM,
        msc: *mut EGLuint64CHROMIUM,
        sbc: *mut EGLuint64CHROMIUM,
    ) -> EGLBoolean,
>;
pub type pixman_bool_t = ::std::os::raw::c_int;
pub type pixman_fixed_32_32_t = i64;
pub type pixman_fixed_48_16_t = pixman_fixed_32_32_t;
pub type pixman_fixed_1_31_t = u32;
pub type pixman_fixed_1_16_t = u32;
pub type pixman_fixed_16_16_t = i32;
pub type pixman_fixed_t = pixman_fixed_16_16_t;
pub type pixman_color_t = pixman_color;
pub type pixman_point_fixed_t = pixman_point_fixed;
pub type pixman_line_fixed_t = pixman_line_fixed;
pub type pixman_vector_t = pixman_vector;
pub type pixman_transform_t = pixman_transform;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_color {
    pub red: u16,
    pub green: u16,
    pub blue: u16,
    pub alpha: u16,
}
#[test]
fn bindgen_test_layout_pixman_color() {
    assert_eq!(
        ::std::mem::size_of::<pixman_color>(),
        8usize,
        concat!("Size of: ", stringify!(pixman_color))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_color>(),
        2usize,
        concat!("Alignment of ", stringify!(pixman_color))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_color>())).red as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_color),
            "::",
            stringify!(red)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_color>())).green as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_color),
            "::",
            stringify!(green)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_color>())).blue as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_color),
            "::",
            stringify!(blue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_color>())).alpha as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_color),
            "::",
            stringify!(alpha)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_point_fixed {
    pub x: pixman_fixed_t,
    pub y: pixman_fixed_t,
}
#[test]
fn bindgen_test_layout_pixman_point_fixed() {
    assert_eq!(
        ::std::mem::size_of::<pixman_point_fixed>(),
        8usize,
        concat!("Size of: ", stringify!(pixman_point_fixed))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_point_fixed>(),
        4usize,
        concat!("Alignment of ", stringify!(pixman_point_fixed))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_point_fixed>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_point_fixed),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_point_fixed>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_point_fixed),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_line_fixed {
    pub p1: pixman_point_fixed_t,
    pub p2: pixman_point_fixed_t,
}
#[test]
fn bindgen_test_layout_pixman_line_fixed() {
    assert_eq!(
        ::std::mem::size_of::<pixman_line_fixed>(),
        16usize,
        concat!("Size of: ", stringify!(pixman_line_fixed))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_line_fixed>(),
        4usize,
        concat!("Alignment of ", stringify!(pixman_line_fixed))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_line_fixed>())).p1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_line_fixed),
            "::",
            stringify!(p1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_line_fixed>())).p2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_line_fixed),
            "::",
            stringify!(p2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_vector {
    pub vector: [pixman_fixed_t; 3usize],
}
#[test]
fn bindgen_test_layout_pixman_vector() {
    assert_eq!(
        ::std::mem::size_of::<pixman_vector>(),
        12usize,
        concat!("Size of: ", stringify!(pixman_vector))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_vector>(),
        4usize,
        concat!("Alignment of ", stringify!(pixman_vector))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_vector>())).vector as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_vector),
            "::",
            stringify!(vector)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_transform {
    pub matrix: [[pixman_fixed_t; 3usize]; 3usize],
}
#[test]
fn bindgen_test_layout_pixman_transform() {
    assert_eq!(
        ::std::mem::size_of::<pixman_transform>(),
        36usize,
        concat!("Size of: ", stringify!(pixman_transform))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_transform>(),
        4usize,
        concat!("Alignment of ", stringify!(pixman_transform))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_transform>())).matrix as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_transform),
            "::",
            stringify!(matrix)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pixman_image {
    _unused: [u8; 0],
}
pub type pixman_image_t = pixman_image;
extern "C" {
    pub fn pixman_transform_init_identity(matrix: *mut pixman_transform);
}
extern "C" {
    pub fn pixman_transform_point_3d(
        transform: *const pixman_transform,
        vector: *mut pixman_vector,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_transform_point(
        transform: *const pixman_transform,
        vector: *mut pixman_vector,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_transform_multiply(
        dst: *mut pixman_transform,
        l: *const pixman_transform,
        r: *const pixman_transform,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_transform_init_scale(
        t: *mut pixman_transform,
        sx: pixman_fixed_t,
        sy: pixman_fixed_t,
    );
}
extern "C" {
    pub fn pixman_transform_scale(
        forward: *mut pixman_transform,
        reverse: *mut pixman_transform,
        sx: pixman_fixed_t,
        sy: pixman_fixed_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_transform_init_rotate(
        t: *mut pixman_transform,
        cos: pixman_fixed_t,
        sin: pixman_fixed_t,
    );
}
extern "C" {
    pub fn pixman_transform_rotate(
        forward: *mut pixman_transform,
        reverse: *mut pixman_transform,
        c: pixman_fixed_t,
        s: pixman_fixed_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_transform_init_translate(
        t: *mut pixman_transform,
        tx: pixman_fixed_t,
        ty: pixman_fixed_t,
    );
}
extern "C" {
    pub fn pixman_transform_translate(
        forward: *mut pixman_transform,
        reverse: *mut pixman_transform,
        tx: pixman_fixed_t,
        ty: pixman_fixed_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_transform_bounds(
        matrix: *const pixman_transform,
        b: *mut pixman_box16,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_transform_invert(
        dst: *mut pixman_transform,
        src: *const pixman_transform,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_transform_is_identity(t: *const pixman_transform) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_transform_is_scale(t: *const pixman_transform) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_transform_is_int_translate(t: *const pixman_transform) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_transform_is_inverse(
        a: *const pixman_transform,
        b: *const pixman_transform,
    ) -> pixman_bool_t;
}
pub type pixman_f_transform_t = pixman_f_transform;
pub type pixman_f_vector_t = pixman_f_vector;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_f_vector {
    pub v: [f64; 3usize],
}
#[test]
fn bindgen_test_layout_pixman_f_vector() {
    assert_eq!(
        ::std::mem::size_of::<pixman_f_vector>(),
        24usize,
        concat!("Size of: ", stringify!(pixman_f_vector))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_f_vector>(),
        8usize,
        concat!("Alignment of ", stringify!(pixman_f_vector))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_f_vector>())).v as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_f_vector),
            "::",
            stringify!(v)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_f_transform {
    pub m: [[f64; 3usize]; 3usize],
}
#[test]
fn bindgen_test_layout_pixman_f_transform() {
    assert_eq!(
        ::std::mem::size_of::<pixman_f_transform>(),
        72usize,
        concat!("Size of: ", stringify!(pixman_f_transform))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_f_transform>(),
        8usize,
        concat!("Alignment of ", stringify!(pixman_f_transform))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_f_transform>())).m as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_f_transform),
            "::",
            stringify!(m)
        )
    );
}
extern "C" {
    pub fn pixman_transform_from_pixman_f_transform(
        t: *mut pixman_transform,
        ft: *const pixman_f_transform,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_f_transform_from_pixman_transform(
        ft: *mut pixman_f_transform,
        t: *const pixman_transform,
    );
}
extern "C" {
    pub fn pixman_f_transform_invert(
        dst: *mut pixman_f_transform,
        src: *const pixman_f_transform,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_f_transform_point(
        t: *const pixman_f_transform,
        v: *mut pixman_f_vector,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_f_transform_point_3d(t: *const pixman_f_transform, v: *mut pixman_f_vector);
}
extern "C" {
    pub fn pixman_f_transform_multiply(
        dst: *mut pixman_f_transform,
        l: *const pixman_f_transform,
        r: *const pixman_f_transform,
    );
}
extern "C" {
    pub fn pixman_f_transform_init_scale(t: *mut pixman_f_transform, sx: f64, sy: f64);
}
extern "C" {
    pub fn pixman_f_transform_scale(
        forward: *mut pixman_f_transform,
        reverse: *mut pixman_f_transform,
        sx: f64,
        sy: f64,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_f_transform_init_rotate(t: *mut pixman_f_transform, cos: f64, sin: f64);
}
extern "C" {
    pub fn pixman_f_transform_rotate(
        forward: *mut pixman_f_transform,
        reverse: *mut pixman_f_transform,
        c: f64,
        s: f64,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_f_transform_init_translate(t: *mut pixman_f_transform, tx: f64, ty: f64);
}
extern "C" {
    pub fn pixman_f_transform_translate(
        forward: *mut pixman_f_transform,
        reverse: *mut pixman_f_transform,
        tx: f64,
        ty: f64,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_f_transform_bounds(
        t: *const pixman_f_transform,
        b: *mut pixman_box16,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_f_transform_init_identity(t: *mut pixman_f_transform);
}
pub mod pixman_repeat_t {
    pub type Type = u32;
    pub const PIXMAN_REPEAT_NONE: Type = 0;
    pub const PIXMAN_REPEAT_NORMAL: Type = 1;
    pub const PIXMAN_REPEAT_PAD: Type = 2;
    pub const PIXMAN_REPEAT_REFLECT: Type = 3;
}
pub mod pixman_filter_t {
    pub type Type = u32;
    pub const PIXMAN_FILTER_FAST: Type = 0;
    pub const PIXMAN_FILTER_GOOD: Type = 1;
    pub const PIXMAN_FILTER_BEST: Type = 2;
    pub const PIXMAN_FILTER_NEAREST: Type = 3;
    pub const PIXMAN_FILTER_BILINEAR: Type = 4;
    pub const PIXMAN_FILTER_CONVOLUTION: Type = 5;
    pub const PIXMAN_FILTER_SEPARABLE_CONVOLUTION: Type = 6;
}
pub mod pixman_op_t {
    pub type Type = u32;
    pub const PIXMAN_OP_CLEAR: Type = 0;
    pub const PIXMAN_OP_SRC: Type = 1;
    pub const PIXMAN_OP_DST: Type = 2;
    pub const PIXMAN_OP_OVER: Type = 3;
    pub const PIXMAN_OP_OVER_REVERSE: Type = 4;
    pub const PIXMAN_OP_IN: Type = 5;
    pub const PIXMAN_OP_IN_REVERSE: Type = 6;
    pub const PIXMAN_OP_OUT: Type = 7;
    pub const PIXMAN_OP_OUT_REVERSE: Type = 8;
    pub const PIXMAN_OP_ATOP: Type = 9;
    pub const PIXMAN_OP_ATOP_REVERSE: Type = 10;
    pub const PIXMAN_OP_XOR: Type = 11;
    pub const PIXMAN_OP_ADD: Type = 12;
    pub const PIXMAN_OP_SATURATE: Type = 13;
    pub const PIXMAN_OP_DISJOINT_CLEAR: Type = 16;
    pub const PIXMAN_OP_DISJOINT_SRC: Type = 17;
    pub const PIXMAN_OP_DISJOINT_DST: Type = 18;
    pub const PIXMAN_OP_DISJOINT_OVER: Type = 19;
    pub const PIXMAN_OP_DISJOINT_OVER_REVERSE: Type = 20;
    pub const PIXMAN_OP_DISJOINT_IN: Type = 21;
    pub const PIXMAN_OP_DISJOINT_IN_REVERSE: Type = 22;
    pub const PIXMAN_OP_DISJOINT_OUT: Type = 23;
    pub const PIXMAN_OP_DISJOINT_OUT_REVERSE: Type = 24;
    pub const PIXMAN_OP_DISJOINT_ATOP: Type = 25;
    pub const PIXMAN_OP_DISJOINT_ATOP_REVERSE: Type = 26;
    pub const PIXMAN_OP_DISJOINT_XOR: Type = 27;
    pub const PIXMAN_OP_CONJOINT_CLEAR: Type = 32;
    pub const PIXMAN_OP_CONJOINT_SRC: Type = 33;
    pub const PIXMAN_OP_CONJOINT_DST: Type = 34;
    pub const PIXMAN_OP_CONJOINT_OVER: Type = 35;
    pub const PIXMAN_OP_CONJOINT_OVER_REVERSE: Type = 36;
    pub const PIXMAN_OP_CONJOINT_IN: Type = 37;
    pub const PIXMAN_OP_CONJOINT_IN_REVERSE: Type = 38;
    pub const PIXMAN_OP_CONJOINT_OUT: Type = 39;
    pub const PIXMAN_OP_CONJOINT_OUT_REVERSE: Type = 40;
    pub const PIXMAN_OP_CONJOINT_ATOP: Type = 41;
    pub const PIXMAN_OP_CONJOINT_ATOP_REVERSE: Type = 42;
    pub const PIXMAN_OP_CONJOINT_XOR: Type = 43;
    pub const PIXMAN_OP_MULTIPLY: Type = 48;
    pub const PIXMAN_OP_SCREEN: Type = 49;
    pub const PIXMAN_OP_OVERLAY: Type = 50;
    pub const PIXMAN_OP_DARKEN: Type = 51;
    pub const PIXMAN_OP_LIGHTEN: Type = 52;
    pub const PIXMAN_OP_COLOR_DODGE: Type = 53;
    pub const PIXMAN_OP_COLOR_BURN: Type = 54;
    pub const PIXMAN_OP_HARD_LIGHT: Type = 55;
    pub const PIXMAN_OP_SOFT_LIGHT: Type = 56;
    pub const PIXMAN_OP_DIFFERENCE: Type = 57;
    pub const PIXMAN_OP_EXCLUSION: Type = 58;
    pub const PIXMAN_OP_HSL_HUE: Type = 59;
    pub const PIXMAN_OP_HSL_SATURATION: Type = 60;
    pub const PIXMAN_OP_HSL_COLOR: Type = 61;
    pub const PIXMAN_OP_HSL_LUMINOSITY: Type = 62;
}
pub type pixman_region16_data_t = pixman_region16_data;
pub type pixman_box16_t = pixman_box16;
pub type pixman_rectangle16_t = pixman_rectangle16;
pub type pixman_region16_t = pixman_region16;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_region16_data {
    pub size: ::std::os::raw::c_long,
    pub numRects: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pixman_region16_data() {
    assert_eq!(
        ::std::mem::size_of::<pixman_region16_data>(),
        16usize,
        concat!("Size of: ", stringify!(pixman_region16_data))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_region16_data>(),
        8usize,
        concat!("Alignment of ", stringify!(pixman_region16_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_region16_data>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_region16_data),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_region16_data>())).numRects as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_region16_data),
            "::",
            stringify!(numRects)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_rectangle16 {
    pub x: i16,
    pub y: i16,
    pub width: u16,
    pub height: u16,
}
#[test]
fn bindgen_test_layout_pixman_rectangle16() {
    assert_eq!(
        ::std::mem::size_of::<pixman_rectangle16>(),
        8usize,
        concat!("Size of: ", stringify!(pixman_rectangle16))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_rectangle16>(),
        2usize,
        concat!("Alignment of ", stringify!(pixman_rectangle16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_rectangle16>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_rectangle16),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_rectangle16>())).y as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_rectangle16),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_rectangle16>())).width as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_rectangle16),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_rectangle16>())).height as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_rectangle16),
            "::",
            stringify!(height)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_box16 {
    pub x1: i16,
    pub y1: i16,
    pub x2: i16,
    pub y2: i16,
}
#[test]
fn bindgen_test_layout_pixman_box16() {
    assert_eq!(
        ::std::mem::size_of::<pixman_box16>(),
        8usize,
        concat!("Size of: ", stringify!(pixman_box16))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_box16>(),
        2usize,
        concat!("Alignment of ", stringify!(pixman_box16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_box16>())).x1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_box16),
            "::",
            stringify!(x1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_box16>())).y1 as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_box16),
            "::",
            stringify!(y1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_box16>())).x2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_box16),
            "::",
            stringify!(x2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_box16>())).y2 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_box16),
            "::",
            stringify!(y2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_region16 {
    pub extents: pixman_box16_t,
    pub data: *mut pixman_region16_data_t,
}
#[test]
fn bindgen_test_layout_pixman_region16() {
    assert_eq!(
        ::std::mem::size_of::<pixman_region16>(),
        16usize,
        concat!("Size of: ", stringify!(pixman_region16))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_region16>(),
        8usize,
        concat!("Alignment of ", stringify!(pixman_region16))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_region16>())).extents as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_region16),
            "::",
            stringify!(extents)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_region16>())).data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_region16),
            "::",
            stringify!(data)
        )
    );
}
pub mod pixman_region_overlap_t {
    pub type Type = u32;
    pub const PIXMAN_REGION_OUT: Type = 0;
    pub const PIXMAN_REGION_IN: Type = 1;
    pub const PIXMAN_REGION_PART: Type = 2;
}
extern "C" {
    pub fn pixman_region_set_static_pointers(
        empty_box: *mut pixman_box16_t,
        empty_data: *mut pixman_region16_data_t,
        broken_data: *mut pixman_region16_data_t,
    );
}
extern "C" {
    pub fn pixman_region_init(region: *mut pixman_region16_t);
}
extern "C" {
    pub fn pixman_region_init_rect(
        region: *mut pixman_region16_t,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        width: ::std::os::raw::c_uint,
        height: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn pixman_region_init_rects(
        region: *mut pixman_region16_t,
        boxes: *const pixman_box16_t,
        count: ::std::os::raw::c_int,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region_init_with_extents(
        region: *mut pixman_region16_t,
        extents: *mut pixman_box16_t,
    );
}
extern "C" {
    pub fn pixman_region_init_from_image(
        region: *mut pixman_region16_t,
        image: *mut pixman_image_t,
    );
}
extern "C" {
    pub fn pixman_region_fini(region: *mut pixman_region16_t);
}
extern "C" {
    pub fn pixman_region_translate(
        region: *mut pixman_region16_t,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn pixman_region_copy(
        dest: *mut pixman_region16_t,
        source: *mut pixman_region16_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region_intersect(
        new_reg: *mut pixman_region16_t,
        reg1: *mut pixman_region16_t,
        reg2: *mut pixman_region16_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region_union(
        new_reg: *mut pixman_region16_t,
        reg1: *mut pixman_region16_t,
        reg2: *mut pixman_region16_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region_union_rect(
        dest: *mut pixman_region16_t,
        source: *mut pixman_region16_t,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        width: ::std::os::raw::c_uint,
        height: ::std::os::raw::c_uint,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region_intersect_rect(
        dest: *mut pixman_region16_t,
        source: *mut pixman_region16_t,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        width: ::std::os::raw::c_uint,
        height: ::std::os::raw::c_uint,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region_subtract(
        reg_d: *mut pixman_region16_t,
        reg_m: *mut pixman_region16_t,
        reg_s: *mut pixman_region16_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region_inverse(
        new_reg: *mut pixman_region16_t,
        reg1: *mut pixman_region16_t,
        inv_rect: *mut pixman_box16_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region_contains_point(
        region: *mut pixman_region16_t,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        box_: *mut pixman_box16_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region_contains_rectangle(
        region: *mut pixman_region16_t,
        prect: *mut pixman_box16_t,
    ) -> pixman_region_overlap_t::Type;
}
extern "C" {
    pub fn pixman_region_not_empty(region: *mut pixman_region16_t) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region_extents(region: *mut pixman_region16_t) -> *mut pixman_box16_t;
}
extern "C" {
    pub fn pixman_region_n_rects(region: *mut pixman_region16_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pixman_region_rectangles(
        region: *mut pixman_region16_t,
        n_rects: *mut ::std::os::raw::c_int,
    ) -> *mut pixman_box16_t;
}
extern "C" {
    pub fn pixman_region_equal(
        region1: *mut pixman_region16_t,
        region2: *mut pixman_region16_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region_selfcheck(region: *mut pixman_region16_t) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region_reset(region: *mut pixman_region16_t, box_: *mut pixman_box16_t);
}
extern "C" {
    pub fn pixman_region_clear(region: *mut pixman_region16_t);
}
pub type pixman_region32_data_t = pixman_region32_data;
pub type pixman_box32_t = pixman_box32;
pub type pixman_rectangle32_t = pixman_rectangle32;
pub type pixman_region32_t = pixman_region32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_region32_data {
    pub size: ::std::os::raw::c_long,
    pub numRects: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pixman_region32_data() {
    assert_eq!(
        ::std::mem::size_of::<pixman_region32_data>(),
        16usize,
        concat!("Size of: ", stringify!(pixman_region32_data))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_region32_data>(),
        8usize,
        concat!("Alignment of ", stringify!(pixman_region32_data))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_region32_data>())).size as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_region32_data),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_region32_data>())).numRects as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_region32_data),
            "::",
            stringify!(numRects)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_rectangle32 {
    pub x: i32,
    pub y: i32,
    pub width: u32,
    pub height: u32,
}
#[test]
fn bindgen_test_layout_pixman_rectangle32() {
    assert_eq!(
        ::std::mem::size_of::<pixman_rectangle32>(),
        16usize,
        concat!("Size of: ", stringify!(pixman_rectangle32))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_rectangle32>(),
        4usize,
        concat!("Alignment of ", stringify!(pixman_rectangle32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_rectangle32>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_rectangle32),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_rectangle32>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_rectangle32),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_rectangle32>())).width as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_rectangle32),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_rectangle32>())).height as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_rectangle32),
            "::",
            stringify!(height)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_box32 {
    pub x1: i32,
    pub y1: i32,
    pub x2: i32,
    pub y2: i32,
}
#[test]
fn bindgen_test_layout_pixman_box32() {
    assert_eq!(
        ::std::mem::size_of::<pixman_box32>(),
        16usize,
        concat!("Size of: ", stringify!(pixman_box32))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_box32>(),
        4usize,
        concat!("Alignment of ", stringify!(pixman_box32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_box32>())).x1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_box32),
            "::",
            stringify!(x1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_box32>())).y1 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_box32),
            "::",
            stringify!(y1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_box32>())).x2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_box32),
            "::",
            stringify!(x2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_box32>())).y2 as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_box32),
            "::",
            stringify!(y2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_region32 {
    pub extents: pixman_box32_t,
    pub data: *mut pixman_region32_data_t,
}
#[test]
fn bindgen_test_layout_pixman_region32() {
    assert_eq!(
        ::std::mem::size_of::<pixman_region32>(),
        24usize,
        concat!("Size of: ", stringify!(pixman_region32))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_region32>(),
        8usize,
        concat!("Alignment of ", stringify!(pixman_region32))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_region32>())).extents as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_region32),
            "::",
            stringify!(extents)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_region32>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_region32),
            "::",
            stringify!(data)
        )
    );
}
extern "C" {
    pub fn pixman_region32_init(region: *mut pixman_region32_t);
}
extern "C" {
    pub fn pixman_region32_init_rect(
        region: *mut pixman_region32_t,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        width: ::std::os::raw::c_uint,
        height: ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn pixman_region32_init_rects(
        region: *mut pixman_region32_t,
        boxes: *const pixman_box32_t,
        count: ::std::os::raw::c_int,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region32_init_with_extents(
        region: *mut pixman_region32_t,
        extents: *mut pixman_box32_t,
    );
}
extern "C" {
    pub fn pixman_region32_init_from_image(
        region: *mut pixman_region32_t,
        image: *mut pixman_image_t,
    );
}
extern "C" {
    pub fn pixman_region32_fini(region: *mut pixman_region32_t);
}
extern "C" {
    pub fn pixman_region32_translate(
        region: *mut pixman_region32_t,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn pixman_region32_copy(
        dest: *mut pixman_region32_t,
        source: *mut pixman_region32_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region32_intersect(
        new_reg: *mut pixman_region32_t,
        reg1: *mut pixman_region32_t,
        reg2: *mut pixman_region32_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region32_union(
        new_reg: *mut pixman_region32_t,
        reg1: *mut pixman_region32_t,
        reg2: *mut pixman_region32_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region32_intersect_rect(
        dest: *mut pixman_region32_t,
        source: *mut pixman_region32_t,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        width: ::std::os::raw::c_uint,
        height: ::std::os::raw::c_uint,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region32_union_rect(
        dest: *mut pixman_region32_t,
        source: *mut pixman_region32_t,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        width: ::std::os::raw::c_uint,
        height: ::std::os::raw::c_uint,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region32_subtract(
        reg_d: *mut pixman_region32_t,
        reg_m: *mut pixman_region32_t,
        reg_s: *mut pixman_region32_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region32_inverse(
        new_reg: *mut pixman_region32_t,
        reg1: *mut pixman_region32_t,
        inv_rect: *mut pixman_box32_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region32_contains_point(
        region: *mut pixman_region32_t,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        box_: *mut pixman_box32_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region32_contains_rectangle(
        region: *mut pixman_region32_t,
        prect: *mut pixman_box32_t,
    ) -> pixman_region_overlap_t::Type;
}
extern "C" {
    pub fn pixman_region32_not_empty(region: *mut pixman_region32_t) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region32_extents(region: *mut pixman_region32_t) -> *mut pixman_box32_t;
}
extern "C" {
    pub fn pixman_region32_n_rects(region: *mut pixman_region32_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pixman_region32_rectangles(
        region: *mut pixman_region32_t,
        n_rects: *mut ::std::os::raw::c_int,
    ) -> *mut pixman_box32_t;
}
extern "C" {
    pub fn pixman_region32_equal(
        region1: *mut pixman_region32_t,
        region2: *mut pixman_region32_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region32_selfcheck(region: *mut pixman_region32_t) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_region32_reset(region: *mut pixman_region32_t, box_: *mut pixman_box32_t);
}
extern "C" {
    pub fn pixman_region32_clear(region: *mut pixman_region32_t);
}
extern "C" {
    pub fn pixman_blt(
        src_bits: *mut u32,
        dst_bits: *mut u32,
        src_stride: ::std::os::raw::c_int,
        dst_stride: ::std::os::raw::c_int,
        src_bpp: ::std::os::raw::c_int,
        dst_bpp: ::std::os::raw::c_int,
        src_x: ::std::os::raw::c_int,
        src_y: ::std::os::raw::c_int,
        dest_x: ::std::os::raw::c_int,
        dest_y: ::std::os::raw::c_int,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_fill(
        bits: *mut u32,
        stride: ::std::os::raw::c_int,
        bpp: ::std::os::raw::c_int,
        x: ::std::os::raw::c_int,
        y: ::std::os::raw::c_int,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        _xor: u32,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_version() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pixman_version_string() -> *const ::std::os::raw::c_char;
}
pub type pixman_indexed_t = pixman_indexed;
pub type pixman_gradient_stop_t = pixman_gradient_stop;
pub type pixman_read_memory_func_t = ::std::option::Option<
    unsafe extern "C" fn(src: *const ::std::os::raw::c_void, size: ::std::os::raw::c_int) -> u32,
>;
pub type pixman_write_memory_func_t = ::std::option::Option<
    unsafe extern "C" fn(dst: *mut ::std::os::raw::c_void, value: u32, size: ::std::os::raw::c_int),
>;
pub type pixman_image_destroy_func_t = ::std::option::Option<
    unsafe extern "C" fn(image: *mut pixman_image_t, data: *mut ::std::os::raw::c_void),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_gradient_stop {
    pub x: pixman_fixed_t,
    pub color: pixman_color_t,
}
#[test]
fn bindgen_test_layout_pixman_gradient_stop() {
    assert_eq!(
        ::std::mem::size_of::<pixman_gradient_stop>(),
        12usize,
        concat!("Size of: ", stringify!(pixman_gradient_stop))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_gradient_stop>(),
        4usize,
        concat!("Alignment of ", stringify!(pixman_gradient_stop))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_gradient_stop>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_gradient_stop),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_gradient_stop>())).color as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_gradient_stop),
            "::",
            stringify!(color)
        )
    );
}
pub type pixman_index_type = u8;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pixman_indexed {
    pub color: pixman_bool_t,
    pub rgba: [u32; 256usize],
    pub ent: [pixman_index_type; 32768usize],
}
#[test]
fn bindgen_test_layout_pixman_indexed() {
    assert_eq!(
        ::std::mem::size_of::<pixman_indexed>(),
        33796usize,
        concat!("Size of: ", stringify!(pixman_indexed))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_indexed>(),
        4usize,
        concat!("Alignment of ", stringify!(pixman_indexed))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_indexed>())).color as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_indexed),
            "::",
            stringify!(color)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_indexed>())).rgba as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_indexed),
            "::",
            stringify!(rgba)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_indexed>())).ent as *const _ as usize },
        1028usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_indexed),
            "::",
            stringify!(ent)
        )
    );
}
pub mod pixman_format_code_t {
    pub type Type = u32;
    pub const PIXMAN_rgba_float: Type = 281756740;
    pub const PIXMAN_rgb_float: Type = 214631492;
    pub const PIXMAN_a8r8g8b8: Type = 537036936;
    pub const PIXMAN_x8r8g8b8: Type = 537004168;
    pub const PIXMAN_a8b8g8r8: Type = 537102472;
    pub const PIXMAN_x8b8g8r8: Type = 537069704;
    pub const PIXMAN_b8g8r8a8: Type = 537430152;
    pub const PIXMAN_b8g8r8x8: Type = 537397384;
    pub const PIXMAN_r8g8b8a8: Type = 537495688;
    pub const PIXMAN_r8g8b8x8: Type = 537462920;
    pub const PIXMAN_x14r6g6b6: Type = 537003622;
    pub const PIXMAN_x2r10g10b10: Type = 537004714;
    pub const PIXMAN_a2r10g10b10: Type = 537012906;
    pub const PIXMAN_x2b10g10r10: Type = 537070250;
    pub const PIXMAN_a2b10g10r10: Type = 537078442;
    pub const PIXMAN_a8r8g8b8_sRGB: Type = 537561224;
    pub const PIXMAN_r8g8b8: Type = 402786440;
    pub const PIXMAN_b8g8r8: Type = 402851976;
    pub const PIXMAN_r5g6b5: Type = 268567909;
    pub const PIXMAN_b5g6r5: Type = 268633445;
    pub const PIXMAN_a1r5g5b5: Type = 268571989;
    pub const PIXMAN_x1r5g5b5: Type = 268567893;
    pub const PIXMAN_a1b5g5r5: Type = 268637525;
    pub const PIXMAN_x1b5g5r5: Type = 268633429;
    pub const PIXMAN_a4r4g4b4: Type = 268584004;
    pub const PIXMAN_x4r4g4b4: Type = 268567620;
    pub const PIXMAN_a4b4g4r4: Type = 268649540;
    pub const PIXMAN_x4b4g4r4: Type = 268633156;
    pub const PIXMAN_a8: Type = 134316032;
    pub const PIXMAN_r3g3b2: Type = 134349618;
    pub const PIXMAN_b2g3r3: Type = 134415154;
    pub const PIXMAN_a2r2g2b2: Type = 134357538;
    pub const PIXMAN_a2b2g2r2: Type = 134423074;
    pub const PIXMAN_c8: Type = 134479872;
    pub const PIXMAN_g8: Type = 134545408;
    pub const PIXMAN_x4a4: Type = 134299648;
    pub const PIXMAN_x4c4: Type = 134479872;
    pub const PIXMAN_x4g4: Type = 134545408;
    pub const PIXMAN_a4: Type = 67190784;
    pub const PIXMAN_r1g2b1: Type = 67240225;
    pub const PIXMAN_b1g2r1: Type = 67305761;
    pub const PIXMAN_a1r1g1b1: Type = 67244305;
    pub const PIXMAN_a1b1g1r1: Type = 67309841;
    pub const PIXMAN_c4: Type = 67371008;
    pub const PIXMAN_g4: Type = 67436544;
    pub const PIXMAN_a1: Type = 16846848;
    pub const PIXMAN_g1: Type = 17104896;
    pub const PIXMAN_yuy2: Type = 268828672;
    pub const PIXMAN_yv12: Type = 201785344;
}
extern "C" {
    pub fn pixman_format_supported_destination(format: pixman_format_code_t::Type)
        -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_format_supported_source(format: pixman_format_code_t::Type) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_image_create_solid_fill(color: *const pixman_color_t) -> *mut pixman_image_t;
}
extern "C" {
    pub fn pixman_image_create_linear_gradient(
        p1: *const pixman_point_fixed_t,
        p2: *const pixman_point_fixed_t,
        stops: *const pixman_gradient_stop_t,
        n_stops: ::std::os::raw::c_int,
    ) -> *mut pixman_image_t;
}
extern "C" {
    pub fn pixman_image_create_radial_gradient(
        inner: *const pixman_point_fixed_t,
        outer: *const pixman_point_fixed_t,
        inner_radius: pixman_fixed_t,
        outer_radius: pixman_fixed_t,
        stops: *const pixman_gradient_stop_t,
        n_stops: ::std::os::raw::c_int,
    ) -> *mut pixman_image_t;
}
extern "C" {
    pub fn pixman_image_create_conical_gradient(
        center: *const pixman_point_fixed_t,
        angle: pixman_fixed_t,
        stops: *const pixman_gradient_stop_t,
        n_stops: ::std::os::raw::c_int,
    ) -> *mut pixman_image_t;
}
extern "C" {
    pub fn pixman_image_create_bits(
        format: pixman_format_code_t::Type,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        bits: *mut u32,
        rowstride_bytes: ::std::os::raw::c_int,
    ) -> *mut pixman_image_t;
}
extern "C" {
    pub fn pixman_image_create_bits_no_clear(
        format: pixman_format_code_t::Type,
        width: ::std::os::raw::c_int,
        height: ::std::os::raw::c_int,
        bits: *mut u32,
        rowstride_bytes: ::std::os::raw::c_int,
    ) -> *mut pixman_image_t;
}
extern "C" {
    pub fn pixman_image_ref(image: *mut pixman_image_t) -> *mut pixman_image_t;
}
extern "C" {
    pub fn pixman_image_unref(image: *mut pixman_image_t) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_image_set_destroy_function(
        image: *mut pixman_image_t,
        function: pixman_image_destroy_func_t,
        data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn pixman_image_get_destroy_data(image: *mut pixman_image_t)
        -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn pixman_image_set_clip_region(
        image: *mut pixman_image_t,
        region: *mut pixman_region16_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_image_set_clip_region32(
        image: *mut pixman_image_t,
        region: *mut pixman_region32_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_image_set_has_client_clip(image: *mut pixman_image_t, clien_clip: pixman_bool_t);
}
extern "C" {
    pub fn pixman_image_set_transform(
        image: *mut pixman_image_t,
        transform: *const pixman_transform_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_image_set_repeat(image: *mut pixman_image_t, repeat: pixman_repeat_t::Type);
}
extern "C" {
    pub fn pixman_image_set_filter(
        image: *mut pixman_image_t,
        filter: pixman_filter_t::Type,
        filter_params: *const pixman_fixed_t,
        n_filter_params: ::std::os::raw::c_int,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_image_set_source_clipping(
        image: *mut pixman_image_t,
        source_clipping: pixman_bool_t,
    );
}
extern "C" {
    pub fn pixman_image_set_alpha_map(
        image: *mut pixman_image_t,
        alpha_map: *mut pixman_image_t,
        x: i16,
        y: i16,
    );
}
extern "C" {
    pub fn pixman_image_set_component_alpha(
        image: *mut pixman_image_t,
        component_alpha: pixman_bool_t,
    );
}
extern "C" {
    pub fn pixman_image_get_component_alpha(image: *mut pixman_image_t) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_image_set_accessors(
        image: *mut pixman_image_t,
        read_func: pixman_read_memory_func_t,
        write_func: pixman_write_memory_func_t,
    );
}
extern "C" {
    pub fn pixman_image_set_indexed(image: *mut pixman_image_t, indexed: *const pixman_indexed_t);
}
extern "C" {
    pub fn pixman_image_get_data(image: *mut pixman_image_t) -> *mut u32;
}
extern "C" {
    pub fn pixman_image_get_width(image: *mut pixman_image_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pixman_image_get_height(image: *mut pixman_image_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pixman_image_get_stride(image: *mut pixman_image_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pixman_image_get_depth(image: *mut pixman_image_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pixman_image_get_format(image: *mut pixman_image_t) -> pixman_format_code_t::Type;
}
pub mod pixman_kernel_t {
    pub type Type = u32;
    pub const PIXMAN_KERNEL_IMPULSE: Type = 0;
    pub const PIXMAN_KERNEL_BOX: Type = 1;
    pub const PIXMAN_KERNEL_LINEAR: Type = 2;
    pub const PIXMAN_KERNEL_CUBIC: Type = 3;
    pub const PIXMAN_KERNEL_GAUSSIAN: Type = 4;
    pub const PIXMAN_KERNEL_LANCZOS2: Type = 5;
    pub const PIXMAN_KERNEL_LANCZOS3: Type = 6;
    pub const PIXMAN_KERNEL_LANCZOS3_STRETCHED: Type = 7;
}
extern "C" {
    pub fn pixman_filter_create_separable_convolution(
        n_values: *mut ::std::os::raw::c_int,
        scale_x: pixman_fixed_t,
        scale_y: pixman_fixed_t,
        reconstruct_x: pixman_kernel_t::Type,
        reconstruct_y: pixman_kernel_t::Type,
        sample_x: pixman_kernel_t::Type,
        sample_y: pixman_kernel_t::Type,
        subsample_bits_x: ::std::os::raw::c_int,
        subsample_bits_y: ::std::os::raw::c_int,
    ) -> *mut pixman_fixed_t;
}
extern "C" {
    pub fn pixman_image_fill_rectangles(
        op: pixman_op_t::Type,
        image: *mut pixman_image_t,
        color: *const pixman_color_t,
        n_rects: ::std::os::raw::c_int,
        rects: *const pixman_rectangle16_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_image_fill_boxes(
        op: pixman_op_t::Type,
        dest: *mut pixman_image_t,
        color: *const pixman_color_t,
        n_boxes: ::std::os::raw::c_int,
        boxes: *const pixman_box32_t,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_compute_composite_region(
        region: *mut pixman_region16_t,
        src_image: *mut pixman_image_t,
        mask_image: *mut pixman_image_t,
        dest_image: *mut pixman_image_t,
        src_x: i16,
        src_y: i16,
        mask_x: i16,
        mask_y: i16,
        dest_x: i16,
        dest_y: i16,
        width: u16,
        height: u16,
    ) -> pixman_bool_t;
}
extern "C" {
    pub fn pixman_image_composite(
        op: pixman_op_t::Type,
        src: *mut pixman_image_t,
        mask: *mut pixman_image_t,
        dest: *mut pixman_image_t,
        src_x: i16,
        src_y: i16,
        mask_x: i16,
        mask_y: i16,
        dest_x: i16,
        dest_y: i16,
        width: u16,
        height: u16,
    );
}
extern "C" {
    pub fn pixman_image_composite32(
        op: pixman_op_t::Type,
        src: *mut pixman_image_t,
        mask: *mut pixman_image_t,
        dest: *mut pixman_image_t,
        src_x: i32,
        src_y: i32,
        mask_x: i32,
        mask_y: i32,
        dest_x: i32,
        dest_y: i32,
        width: i32,
        height: i32,
    );
}
extern "C" {
    pub fn pixman_disable_out_of_bounds_workaround();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_glyph_cache_t {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_glyph_t {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub glyph: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_pixman_glyph_t() {
    assert_eq!(
        ::std::mem::size_of::<pixman_glyph_t>(),
        16usize,
        concat!("Size of: ", stringify!(pixman_glyph_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_glyph_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pixman_glyph_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_glyph_t>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_glyph_t),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_glyph_t>())).y as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_glyph_t),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_glyph_t>())).glyph as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_glyph_t),
            "::",
            stringify!(glyph)
        )
    );
}
extern "C" {
    pub fn pixman_glyph_cache_create() -> *mut pixman_glyph_cache_t;
}
extern "C" {
    pub fn pixman_glyph_cache_destroy(cache: *mut pixman_glyph_cache_t);
}
extern "C" {
    pub fn pixman_glyph_cache_freeze(cache: *mut pixman_glyph_cache_t);
}
extern "C" {
    pub fn pixman_glyph_cache_thaw(cache: *mut pixman_glyph_cache_t);
}
extern "C" {
    pub fn pixman_glyph_cache_lookup(
        cache: *mut pixman_glyph_cache_t,
        font_key: *mut ::std::os::raw::c_void,
        glyph_key: *mut ::std::os::raw::c_void,
    ) -> *const ::std::os::raw::c_void;
}
extern "C" {
    pub fn pixman_glyph_cache_insert(
        cache: *mut pixman_glyph_cache_t,
        font_key: *mut ::std::os::raw::c_void,
        glyph_key: *mut ::std::os::raw::c_void,
        origin_x: ::std::os::raw::c_int,
        origin_y: ::std::os::raw::c_int,
        glyph_image: *mut pixman_image_t,
    ) -> *const ::std::os::raw::c_void;
}
extern "C" {
    pub fn pixman_glyph_cache_remove(
        cache: *mut pixman_glyph_cache_t,
        font_key: *mut ::std::os::raw::c_void,
        glyph_key: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn pixman_glyph_get_extents(
        cache: *mut pixman_glyph_cache_t,
        n_glyphs: ::std::os::raw::c_int,
        glyphs: *mut pixman_glyph_t,
        extents: *mut pixman_box32_t,
    );
}
extern "C" {
    pub fn pixman_glyph_get_mask_format(
        cache: *mut pixman_glyph_cache_t,
        n_glyphs: ::std::os::raw::c_int,
        glyphs: *const pixman_glyph_t,
    ) -> pixman_format_code_t::Type;
}
extern "C" {
    pub fn pixman_composite_glyphs(
        op: pixman_op_t::Type,
        src: *mut pixman_image_t,
        dest: *mut pixman_image_t,
        mask_format: pixman_format_code_t::Type,
        src_x: i32,
        src_y: i32,
        mask_x: i32,
        mask_y: i32,
        dest_x: i32,
        dest_y: i32,
        width: i32,
        height: i32,
        cache: *mut pixman_glyph_cache_t,
        n_glyphs: ::std::os::raw::c_int,
        glyphs: *const pixman_glyph_t,
    );
}
extern "C" {
    pub fn pixman_composite_glyphs_no_mask(
        op: pixman_op_t::Type,
        src: *mut pixman_image_t,
        dest: *mut pixman_image_t,
        src_x: i32,
        src_y: i32,
        dest_x: i32,
        dest_y: i32,
        cache: *mut pixman_glyph_cache_t,
        n_glyphs: ::std::os::raw::c_int,
        glyphs: *const pixman_glyph_t,
    );
}
pub type pixman_edge_t = pixman_edge;
pub type pixman_trapezoid_t = pixman_trapezoid;
pub type pixman_trap_t = pixman_trap;
pub type pixman_span_fix_t = pixman_span_fix;
pub type pixman_triangle_t = pixman_triangle;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_edge {
    pub x: pixman_fixed_t,
    pub e: pixman_fixed_t,
    pub stepx: pixman_fixed_t,
    pub signdx: pixman_fixed_t,
    pub dy: pixman_fixed_t,
    pub dx: pixman_fixed_t,
    pub stepx_small: pixman_fixed_t,
    pub stepx_big: pixman_fixed_t,
    pub dx_small: pixman_fixed_t,
    pub dx_big: pixman_fixed_t,
}
#[test]
fn bindgen_test_layout_pixman_edge() {
    assert_eq!(
        ::std::mem::size_of::<pixman_edge>(),
        40usize,
        concat!("Size of: ", stringify!(pixman_edge))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_edge>(),
        4usize,
        concat!("Alignment of ", stringify!(pixman_edge))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_edge>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_edge),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_edge>())).e as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_edge),
            "::",
            stringify!(e)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_edge>())).stepx as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_edge),
            "::",
            stringify!(stepx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_edge>())).signdx as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_edge),
            "::",
            stringify!(signdx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_edge>())).dy as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_edge),
            "::",
            stringify!(dy)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_edge>())).dx as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_edge),
            "::",
            stringify!(dx)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_edge>())).stepx_small as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_edge),
            "::",
            stringify!(stepx_small)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_edge>())).stepx_big as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_edge),
            "::",
            stringify!(stepx_big)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_edge>())).dx_small as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_edge),
            "::",
            stringify!(dx_small)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_edge>())).dx_big as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_edge),
            "::",
            stringify!(dx_big)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_trapezoid {
    pub top: pixman_fixed_t,
    pub bottom: pixman_fixed_t,
    pub left: pixman_line_fixed_t,
    pub right: pixman_line_fixed_t,
}
#[test]
fn bindgen_test_layout_pixman_trapezoid() {
    assert_eq!(
        ::std::mem::size_of::<pixman_trapezoid>(),
        40usize,
        concat!("Size of: ", stringify!(pixman_trapezoid))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_trapezoid>(),
        4usize,
        concat!("Alignment of ", stringify!(pixman_trapezoid))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_trapezoid>())).top as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_trapezoid),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_trapezoid>())).bottom as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_trapezoid),
            "::",
            stringify!(bottom)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_trapezoid>())).left as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_trapezoid),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_trapezoid>())).right as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_trapezoid),
            "::",
            stringify!(right)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_triangle {
    pub p1: pixman_point_fixed_t,
    pub p2: pixman_point_fixed_t,
    pub p3: pixman_point_fixed_t,
}
#[test]
fn bindgen_test_layout_pixman_triangle() {
    assert_eq!(
        ::std::mem::size_of::<pixman_triangle>(),
        24usize,
        concat!("Size of: ", stringify!(pixman_triangle))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_triangle>(),
        4usize,
        concat!("Alignment of ", stringify!(pixman_triangle))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_triangle>())).p1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_triangle),
            "::",
            stringify!(p1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_triangle>())).p2 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_triangle),
            "::",
            stringify!(p2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_triangle>())).p3 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_triangle),
            "::",
            stringify!(p3)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_span_fix {
    pub l: pixman_fixed_t,
    pub r: pixman_fixed_t,
    pub y: pixman_fixed_t,
}
#[test]
fn bindgen_test_layout_pixman_span_fix() {
    assert_eq!(
        ::std::mem::size_of::<pixman_span_fix>(),
        12usize,
        concat!("Size of: ", stringify!(pixman_span_fix))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_span_fix>(),
        4usize,
        concat!("Alignment of ", stringify!(pixman_span_fix))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_span_fix>())).l as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_span_fix),
            "::",
            stringify!(l)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_span_fix>())).r as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_span_fix),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_span_fix>())).y as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_span_fix),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pixman_trap {
    pub top: pixman_span_fix_t,
    pub bot: pixman_span_fix_t,
}
#[test]
fn bindgen_test_layout_pixman_trap() {
    assert_eq!(
        ::std::mem::size_of::<pixman_trap>(),
        24usize,
        concat!("Size of: ", stringify!(pixman_trap))
    );
    assert_eq!(
        ::std::mem::align_of::<pixman_trap>(),
        4usize,
        concat!("Alignment of ", stringify!(pixman_trap))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_trap>())).top as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_trap),
            "::",
            stringify!(top)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<pixman_trap>())).bot as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pixman_trap),
            "::",
            stringify!(bot)
        )
    );
}
extern "C" {
    pub fn pixman_sample_ceil_y(y: pixman_fixed_t, bpp: ::std::os::raw::c_int) -> pixman_fixed_t;
}
extern "C" {
    pub fn pixman_sample_floor_y(y: pixman_fixed_t, bpp: ::std::os::raw::c_int) -> pixman_fixed_t;
}
extern "C" {
    pub fn pixman_edge_step(e: *mut pixman_edge_t, n: ::std::os::raw::c_int);
}
extern "C" {
    pub fn pixman_edge_init(
        e: *mut pixman_edge_t,
        bpp: ::std::os::raw::c_int,
        y_start: pixman_fixed_t,
        x_top: pixman_fixed_t,
        y_top: pixman_fixed_t,
        x_bot: pixman_fixed_t,
        y_bot: pixman_fixed_t,
    );
}
extern "C" {
    pub fn pixman_line_fixed_edge_init(
        e: *mut pixman_edge_t,
        bpp: ::std::os::raw::c_int,
        y: pixman_fixed_t,
        line: *const pixman_line_fixed_t,
        x_off: ::std::os::raw::c_int,
        y_off: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn pixman_rasterize_edges(
        image: *mut pixman_image_t,
        l: *mut pixman_edge_t,
        r: *mut pixman_edge_t,
        t: pixman_fixed_t,
        b: pixman_fixed_t,
    );
}
extern "C" {
    pub fn pixman_add_traps(
        image: *mut pixman_image_t,
        x_off: i16,
        y_off: i16,
        ntrap: ::std::os::raw::c_int,
        traps: *const pixman_trap_t,
    );
}
extern "C" {
    pub fn pixman_add_trapezoids(
        image: *mut pixman_image_t,
        x_off: i16,
        y_off: ::std::os::raw::c_int,
        ntraps: ::std::os::raw::c_int,
        traps: *const pixman_trapezoid_t,
    );
}
extern "C" {
    pub fn pixman_rasterize_trapezoid(
        image: *mut pixman_image_t,
        trap: *const pixman_trapezoid_t,
        x_off: ::std::os::raw::c_int,
        y_off: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn pixman_composite_trapezoids(
        op: pixman_op_t::Type,
        src: *mut pixman_image_t,
        dst: *mut pixman_image_t,
        mask_format: pixman_format_code_t::Type,
        x_src: ::std::os::raw::c_int,
        y_src: ::std::os::raw::c_int,
        x_dst: ::std::os::raw::c_int,
        y_dst: ::std::os::raw::c_int,
        n_traps: ::std::os::raw::c_int,
        traps: *const pixman_trapezoid_t,
    );
}
extern "C" {
    pub fn pixman_composite_triangles(
        op: pixman_op_t::Type,
        src: *mut pixman_image_t,
        dst: *mut pixman_image_t,
        mask_format: pixman_format_code_t::Type,
        x_src: ::std::os::raw::c_int,
        y_src: ::std::os::raw::c_int,
        x_dst: ::std::os::raw::c_int,
        y_dst: ::std::os::raw::c_int,
        n_tris: ::std::os::raw::c_int,
        tris: *const pixman_triangle_t,
    );
}
extern "C" {
    pub fn pixman_add_triangles(
        image: *mut pixman_image_t,
        x_off: i32,
        y_off: i32,
        n_tris: ::std::os::raw::c_int,
        tris: *const pixman_triangle_t,
    );
}
pub mod wlr_dmabuf_attributes_flags {
    pub type Type = u32;
    pub const WLR_DMABUF_ATTRIBUTES_FLAGS_Y_INVERT: Type = 1;
    pub const WLR_DMABUF_ATTRIBUTES_FLAGS_INTERLACED: Type = 2;
    pub const WLR_DMABUF_ATTRIBUTES_FLAGS_BOTTOM_FIRST: Type = 4;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wlr_dmabuf_attributes {
    pub width: i32,
    pub height: i32,
    pub format: u32,
    pub flags: u32,
    pub modifier: u64,
    pub n_planes: ::std::os::raw::c_int,
    pub offset: [u32; 4usize],
    pub stride: [u32; 4usize],
    pub fd: [::std::os::raw::c_int; 4usize],
}
#[test]
fn bindgen_test_layout_wlr_dmabuf_attributes() {
    assert_eq!(
        ::std::mem::size_of::<wlr_dmabuf_attributes>(),
        80usize,
        concat!("Size of: ", stringify!(wlr_dmabuf_attributes))
    );
    assert_eq!(
        ::std::mem::align_of::<wlr_dmabuf_attributes>(),
        8usize,
        concat!("Alignment of ", stringify!(wlr_dmabuf_attributes))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_dmabuf_attributes>())).width as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_dmabuf_attributes),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_dmabuf_attributes>())).height as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_dmabuf_attributes),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_dmabuf_attributes>())).format as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_dmabuf_attributes),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_dmabuf_attributes>())).flags as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_dmabuf_attributes),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_dmabuf_attributes>())).modifier as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_dmabuf_attributes),
            "::",
            stringify!(modifier)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_dmabuf_attributes>())).n_planes as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_dmabuf_attributes),
            "::",
            stringify!(n_planes)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_dmabuf_attributes>())).offset as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_dmabuf_attributes),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_dmabuf_attributes>())).stride as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_dmabuf_attributes),
            "::",
            stringify!(stride)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_dmabuf_attributes>())).fd as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_dmabuf_attributes),
            "::",
            stringify!(fd)
        )
    );
}
extern "C" {
    #[doc = " Closes all file descriptors in the DMA-BUF attributes."]
    pub fn wlr_dmabuf_attributes_finish(attribs: *mut wlr_dmabuf_attributes);
}
extern "C" {
    #[doc = " Clones the DMA-BUF attributes."]
    pub fn wlr_dmabuf_attributes_copy(
        dst: *mut wlr_dmabuf_attributes,
        src: *mut wlr_dmabuf_attributes,
    ) -> bool;
}
#[repr(C)]
#[derive(Debug)]
pub struct wlr_drm_format {
    pub format: u32,
    pub len: usize,
    pub cap: usize,
    pub modifiers: __IncompleteArrayField<u64>,
}
#[test]
fn bindgen_test_layout_wlr_drm_format() {
    assert_eq!(
        ::std::mem::size_of::<wlr_drm_format>(),
        24usize,
        concat!("Size of: ", stringify!(wlr_drm_format))
    );
    assert_eq!(
        ::std::mem::align_of::<wlr_drm_format>(),
        8usize,
        concat!("Alignment of ", stringify!(wlr_drm_format))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wlr_drm_format_set {
    pub len: usize,
    pub cap: usize,
    pub formats: *mut *mut wlr_drm_format,
}
#[test]
fn bindgen_test_layout_wlr_drm_format_set() {
    assert_eq!(
        ::std::mem::size_of::<wlr_drm_format_set>(),
        24usize,
        concat!("Size of: ", stringify!(wlr_drm_format_set))
    );
    assert_eq!(
        ::std::mem::align_of::<wlr_drm_format_set>(),
        8usize,
        concat!("Alignment of ", stringify!(wlr_drm_format_set))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_drm_format_set>())).len as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_drm_format_set),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_drm_format_set>())).cap as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_drm_format_set),
            "::",
            stringify!(cap)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_drm_format_set>())).formats as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_drm_format_set),
            "::",
            stringify!(formats)
        )
    );
}
extern "C" {
    pub fn wlr_drm_format_set_finish(set: *mut wlr_drm_format_set);
}
extern "C" {
    pub fn wlr_drm_format_set_get(
        set: *const wlr_drm_format_set,
        format: u32,
    ) -> *const wlr_drm_format;
}
extern "C" {
    pub fn wlr_drm_format_set_has(
        set: *const wlr_drm_format_set,
        format: u32,
        modifier: u64,
    ) -> bool;
}
extern "C" {
    pub fn wlr_drm_format_set_add(set: *mut wlr_drm_format_set, format: u32, modifier: u64)
        -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wlr_egl {
    pub platform: EGLenum,
    pub display: EGLDisplay,
    pub config: EGLConfig,
    pub context: EGLContext,
    pub exts_str: *const ::std::os::raw::c_char,
    pub exts: wlr_egl__bindgen_ty_1,
    pub wl_display: *mut wl_display,
    pub dmabuf_formats: wlr_drm_format_set,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wlr_egl__bindgen_ty_1 {
    pub bind_wayland_display_wl: bool,
    pub buffer_age_ext: bool,
    pub image_base_khr: bool,
    pub image_dma_buf_export_mesa: bool,
    pub image_dmabuf_import_ext: bool,
    pub image_dmabuf_import_modifiers_ext: bool,
    pub swap_buffers_with_damage_ext: bool,
    pub swap_buffers_with_damage_khr: bool,
}
#[test]
fn bindgen_test_layout_wlr_egl__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<wlr_egl__bindgen_ty_1>(),
        8usize,
        concat!("Size of: ", stringify!(wlr_egl__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<wlr_egl__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(wlr_egl__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wlr_egl__bindgen_ty_1>())).bind_wayland_display_wl as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl__bindgen_ty_1),
            "::",
            stringify!(bind_wayland_display_wl)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wlr_egl__bindgen_ty_1>())).buffer_age_ext as *const _ as usize
        },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl__bindgen_ty_1),
            "::",
            stringify!(buffer_age_ext)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wlr_egl__bindgen_ty_1>())).image_base_khr as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl__bindgen_ty_1),
            "::",
            stringify!(image_base_khr)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wlr_egl__bindgen_ty_1>())).image_dma_buf_export_mesa as *const _
                as usize
        },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl__bindgen_ty_1),
            "::",
            stringify!(image_dma_buf_export_mesa)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wlr_egl__bindgen_ty_1>())).image_dmabuf_import_ext as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl__bindgen_ty_1),
            "::",
            stringify!(image_dmabuf_import_ext)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wlr_egl__bindgen_ty_1>())).image_dmabuf_import_modifiers_ext
                as *const _ as usize
        },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl__bindgen_ty_1),
            "::",
            stringify!(image_dmabuf_import_modifiers_ext)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wlr_egl__bindgen_ty_1>())).swap_buffers_with_damage_ext
                as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl__bindgen_ty_1),
            "::",
            stringify!(swap_buffers_with_damage_ext)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wlr_egl__bindgen_ty_1>())).swap_buffers_with_damage_khr
                as *const _ as usize
        },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl__bindgen_ty_1),
            "::",
            stringify!(swap_buffers_with_damage_khr)
        )
    );
}
#[test]
fn bindgen_test_layout_wlr_egl() {
    assert_eq!(
        ::std::mem::size_of::<wlr_egl>(),
        80usize,
        concat!("Size of: ", stringify!(wlr_egl))
    );
    assert_eq!(
        ::std::mem::align_of::<wlr_egl>(),
        8usize,
        concat!("Alignment of ", stringify!(wlr_egl))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_egl>())).platform as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl),
            "::",
            stringify!(platform)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_egl>())).display as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl),
            "::",
            stringify!(display)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_egl>())).config as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl),
            "::",
            stringify!(config)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_egl>())).context as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl),
            "::",
            stringify!(context)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_egl>())).exts_str as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl),
            "::",
            stringify!(exts_str)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_egl>())).exts as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl),
            "::",
            stringify!(exts)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_egl>())).wl_display as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl),
            "::",
            stringify!(wl_display)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_egl>())).dmabuf_formats as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_egl),
            "::",
            stringify!(dmabuf_formats)
        )
    );
}
extern "C" {
    #[doc = " Initializes an EGL context for the given platform and remote display."]
    #[doc = " Will attempt to load all possibly required api functions."]
    pub fn wlr_egl_init(
        egl: *mut wlr_egl,
        platform: EGLenum,
        remote_display: *mut ::std::os::raw::c_void,
        config_attribs: *mut EGLint,
        visual_id: EGLint,
    ) -> bool;
}
extern "C" {
    #[doc = " Frees all related EGL resources, makes the context not-current and"]
    #[doc = " unbinds a bound wayland display."]
    pub fn wlr_egl_finish(egl: *mut wlr_egl);
}
extern "C" {
    #[doc = " Binds the given display to the EGL instance."]
    #[doc = " This will allow clients to create EGL surfaces from wayland ones and render"]
    #[doc = " to it."]
    pub fn wlr_egl_bind_display(egl: *mut wlr_egl, local_display: *mut wl_display) -> bool;
}
extern "C" {
    #[doc = " Returns a surface for the given native window"]
    #[doc = " The window must match the remote display the wlr_egl was created with."]
    pub fn wlr_egl_create_surface(
        egl: *mut wlr_egl,
        window: *mut ::std::os::raw::c_void,
    ) -> EGLSurface;
}
extern "C" {
    #[doc = " Creates an EGL image from the given wl_drm buffer resource."]
    pub fn wlr_egl_create_image_from_wl_drm(
        egl: *mut wlr_egl,
        data: *mut wl_resource,
        fmt: *mut EGLint,
        width: *mut ::std::os::raw::c_int,
        height: *mut ::std::os::raw::c_int,
        inverted_y: *mut bool,
    ) -> EGLImageKHR;
}
extern "C" {
    #[doc = " Creates an EGL image from the given dmabuf attributes. Check usability"]
    #[doc = " of the dmabuf with wlr_egl_check_import_dmabuf once first."]
    pub fn wlr_egl_create_image_from_dmabuf(
        egl: *mut wlr_egl,
        attributes: *mut wlr_dmabuf_attributes,
    ) -> EGLImageKHR;
}
extern "C" {
    #[doc = " Get the available dmabuf formats"]
    pub fn wlr_egl_get_dmabuf_formats(egl: *mut wlr_egl) -> *const wlr_drm_format_set;
}
extern "C" {
    pub fn wlr_egl_export_image_to_dmabuf(
        egl: *mut wlr_egl,
        image: EGLImageKHR,
        width: i32,
        height: i32,
        flags: u32,
        attribs: *mut wlr_dmabuf_attributes,
    ) -> bool;
}
extern "C" {
    #[doc = " Destroys an EGL image created with the given wlr_egl."]
    pub fn wlr_egl_destroy_image(egl: *mut wlr_egl, image: EGLImageKHR) -> bool;
}
extern "C" {
    pub fn wlr_egl_make_current(
        egl: *mut wlr_egl,
        surface: EGLSurface,
        buffer_age: *mut ::std::os::raw::c_int,
    ) -> bool;
}
extern "C" {
    pub fn wlr_egl_is_current(egl: *mut wlr_egl) -> bool;
}
extern "C" {
    pub fn wlr_egl_swap_buffers(
        egl: *mut wlr_egl,
        surface: EGLSurface,
        damage: *mut pixman_region32_t,
    ) -> bool;
}
extern "C" {
    pub fn wlr_egl_destroy_surface(egl: *mut wlr_egl, surface: EGLSurface) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wlr_backend_impl {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wlr_backend {
    pub impl_: *const wlr_backend_impl,
    pub events: wlr_backend__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct wlr_backend__bindgen_ty_1 {
    #[doc = " Raised when destroyed, passed the wlr_backend reference"]
    pub destroy: wl_signal,
    #[doc = " Raised when new inputs are added, passed the wlr_input_device"]
    pub new_input: wl_signal,
    #[doc = " Raised when new outputs are added, passed the wlr_output"]
    pub new_output: wl_signal,
}
#[test]
fn bindgen_test_layout_wlr_backend__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<wlr_backend__bindgen_ty_1>(),
        48usize,
        concat!("Size of: ", stringify!(wlr_backend__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<wlr_backend__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(wlr_backend__bindgen_ty_1))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wlr_backend__bindgen_ty_1>())).destroy as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_backend__bindgen_ty_1),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wlr_backend__bindgen_ty_1>())).new_input as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_backend__bindgen_ty_1),
            "::",
            stringify!(new_input)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<wlr_backend__bindgen_ty_1>())).new_output as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_backend__bindgen_ty_1),
            "::",
            stringify!(new_output)
        )
    );
}
#[test]
fn bindgen_test_layout_wlr_backend() {
    assert_eq!(
        ::std::mem::size_of::<wlr_backend>(),
        56usize,
        concat!("Size of: ", stringify!(wlr_backend))
    );
    assert_eq!(
        ::std::mem::align_of::<wlr_backend>(),
        8usize,
        concat!("Alignment of ", stringify!(wlr_backend))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_backend>())).impl_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_backend),
            "::",
            stringify!(impl_)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<wlr_backend>())).events as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(wlr_backend),
            "::",
            stringify!(events)
        )
    );
}
pub type wlr_renderer_create_func_t = ::std::option::Option<
    unsafe extern "C" fn(
        egl: *mut wlr_egl,
        platform: EGLenum,
        remote_display: *mut ::std::os::raw::c_void,
        config_attribs: *mut EGLint,
        visual_id: EGLint,
    ) -> *mut wlr_renderer,
>;
extern "C" {
    #[doc = " Automatically initializes the most suitable backend given the environment."]
    #[doc = " Will always return a multibackend. The backend is created but not started."]
    #[doc = " Returns NULL on failure."]
    #[doc = ""]
    #[doc = " The compositor can request to initialize the backend's renderer by setting"]
    #[doc = " the create_render_func. The callback must initialize the given wlr_egl and"]
    #[doc = " return a valid wlr_renderer, or NULL if it has failed to initiaze it."]
    #[doc = " Pass NULL as create_renderer_func to use the backend's default renderer."]
    pub fn wlr_backend_autocreate(
        display: *mut wl_display,
        create_renderer_func: wlr_renderer_create_func_t,
    ) -> *mut wlr_backend;
}
extern "C" {
    #[doc = " Start the backend. This may signal new_input or new_output immediately, but"]
    #[doc = " may also wait until the display's event loop begins. Returns false on"]
    #[doc = " failure."]
    pub fn wlr_backend_start(backend: *mut wlr_backend) -> bool;
}
extern "C" {
    #[doc = " Destroy the backend and clean up all of its resources. Normally called"]
    #[doc = " automatically when the wl_display is destroyed."]
    pub fn wlr_backend_destroy(backend: *mut wlr_backend);
}
extern "C" {
    #[doc = " Obtains the wlr_renderer reference this backend is using."]
    pub fn wlr_backend_get_renderer(backend: *mut wlr_backend) -> *mut wlr_renderer;
}
extern "C" {
    #[doc = " Obtains the wlr_session reference from this backend if there is any."]
    #[doc = " Might return NULL for backends that don't use a session."]
    pub fn wlr_backend_get_session(backend: *mut wlr_backend) -> *mut wlr_session;
}
extern "C" {
    #[doc = " Returns the clock used by the backend for presentation feedback."]
    pub fn wlr_backend_get_presentation_clock(backend: *mut wlr_backend) -> clockid_t;
}
pub mod idtype_t {
    pub type Type = u32;
    pub const P_ALL: Type = 0;
    pub const P_PID: Type = 1;
    pub const P_PGID: Type = 2;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_div_t() {
    assert_eq!(
        ::std::mem::size_of::<div_t>(),
        8usize,
        concat!("Size of: ", stringify!(div_t))
    );
    assert_eq!(
        ::std::mem::align_of::<div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(div_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(div_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_ldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<ldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(ldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<ldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<ldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[test]
fn bindgen_test_layout_lldiv_t() {
    assert_eq!(
        ::std::mem::size_of::<lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(lldiv_t))
    );
    assert_eq!(
        ::std::mem::align_of::<lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lldiv_t),
            "::",
            stringify!(quot)
